/* automatically generated by rust-bindgen 0.72.1 */

pub const COLOR_NAMED_BLACK: u32 = 0;
pub const COLOR_NAMED_RED: u32 = 1;
pub const COLOR_NAMED_GREEN: u32 = 2;
pub const COLOR_NAMED_YELLOW: u32 = 3;
pub const COLOR_NAMED_BLUE: u32 = 4;
pub const COLOR_NAMED_MAGENTA: u32 = 5;
pub const COLOR_NAMED_CYAN: u32 = 6;
pub const COLOR_NAMED_WHITE: u32 = 7;
pub const COLOR_NAMED_BRIGHT_BLACK: u32 = 8;
pub const COLOR_NAMED_BRIGHT_RED: u32 = 9;
pub const COLOR_NAMED_BRIGHT_GREEN: u32 = 10;
pub const COLOR_NAMED_BRIGHT_YELLOW: u32 = 11;
pub const COLOR_NAMED_BRIGHT_BLUE: u32 = 12;
pub const COLOR_NAMED_BRIGHT_MAGENTA: u32 = 13;
pub const COLOR_NAMED_BRIGHT_CYAN: u32 = 14;
pub const COLOR_NAMED_BRIGHT_WHITE: u32 = 15;
pub const DA_CONFORMANCE_VT100: u16 = 1;
pub const DA_CONFORMANCE_VT101: u16 = 1;
pub const DA_CONFORMANCE_VT102: u16 = 6;
pub const DA_CONFORMANCE_VT125: u16 = 12;
pub const DA_CONFORMANCE_VT131: u16 = 7;
pub const DA_CONFORMANCE_VT132: u16 = 4;
pub const DA_CONFORMANCE_VT220: u16 = 62;
pub const DA_CONFORMANCE_VT240: u16 = 62;
pub const DA_CONFORMANCE_VT320: u16 = 63;
pub const DA_CONFORMANCE_VT340: u16 = 63;
pub const DA_CONFORMANCE_VT420: u16 = 64;
pub const DA_CONFORMANCE_VT510: u16 = 65;
pub const DA_CONFORMANCE_VT520: u16 = 65;
pub const DA_CONFORMANCE_VT525: u16 = 65;
pub const DA_CONFORMANCE_LEVEL_2: u16 = 62;
pub const DA_CONFORMANCE_LEVEL_3: u16 = 63;
pub const DA_CONFORMANCE_LEVEL_4: u16 = 64;
pub const DA_CONFORMANCE_LEVEL_5: u16 = 65;
pub const DA_FEATURE_COLUMNS_132: u16 = 1;
pub const DA_FEATURE_PRINTER: u16 = 2;
pub const DA_FEATURE_REGIS: u16 = 3;
pub const DA_FEATURE_SIXEL: u16 = 4;
pub const DA_FEATURE_SELECTIVE_ERASE: u16 = 6;
pub const DA_FEATURE_USER_DEFINED_KEYS: u16 = 8;
pub const DA_FEATURE_NATIONAL_REPLACEMENT: u16 = 9;
pub const DA_FEATURE_TECHNICAL_CHARACTERS: u16 = 15;
pub const DA_FEATURE_LOCATOR: u16 = 16;
pub const DA_FEATURE_TERMINAL_STATE: u16 = 17;
pub const DA_FEATURE_WINDOWING: u16 = 18;
pub const DA_FEATURE_HORIZONTAL_SCROLLING: u16 = 21;
pub const DA_FEATURE_ANSI_COLOR: u16 = 22;
pub const DA_FEATURE_RECTANGULAR_EDITING: u16 = 28;
pub const DA_FEATURE_ANSI_TEXT_LOCATOR: u16 = 29;
pub const DA_FEATURE_CLIPBOARD: u16 = 52;
pub const DA_DEVICE_TYPE_VT100: u16 = 0;
pub const DA_DEVICE_TYPE_VT220: u16 = 1;
pub const DA_DEVICE_TYPE_VT240: u16 = 2;
pub const DA_DEVICE_TYPE_VT330: u16 = 18;
pub const DA_DEVICE_TYPE_VT340: u16 = 19;
pub const DA_DEVICE_TYPE_VT320: u16 = 24;
pub const DA_DEVICE_TYPE_VT382: u16 = 32;
pub const DA_DEVICE_TYPE_VT420: u16 = 41;
pub const DA_DEVICE_TYPE_VT510: u16 = 61;
pub const DA_DEVICE_TYPE_VT520: u16 = 64;
pub const DA_DEVICE_TYPE_VT525: u16 = 65;
pub const MODS_SHIFT: u16 = 1;
pub const MODS_CTRL: u16 = 2;
pub const MODS_ALT: u16 = 4;
pub const MODS_SUPER: u16 = 8;
pub const MODS_CAPS_LOCK: u16 = 16;
pub const MODS_NUM_LOCK: u16 = 32;
pub const MODS_SHIFT_SIDE: u16 = 64;
pub const MODS_CTRL_SIDE: u16 = 128;
pub const MODS_ALT_SIDE: u16 = 256;
pub const MODS_SUPER_SIDE: u16 = 512;
pub const KITTY_KEY_DISABLED: u8 = 0;
pub const KITTY_KEY_DISAMBIGUATE: u8 = 1;
pub const KITTY_KEY_REPORT_EVENTS: u8 = 2;
pub const KITTY_KEY_REPORT_ALTERNATES: u8 = 4;
pub const KITTY_KEY_REPORT_ALL: u8 = 8;
pub const KITTY_KEY_REPORT_ASSOCIATED: u8 = 16;
pub const KITTY_KEY_ALL: u8 = 31;
pub mod Result {
    #[doc = " Result codes for libghostty-vt operations."]
    pub type Type = ::std::os::raw::c_int;
    #[doc = " Operation completed successfully"]
    pub const SUCCESS: Type = 0;
    #[doc = " Operation failed due to failed allocation"]
    pub const OUT_OF_MEMORY: Type = -1;
    #[doc = " Operation failed due to invalid value"]
    pub const INVALID_VALUE: Type = -2;
    #[doc = " Operation failed because the provided buffer was too small"]
    pub const OUT_OF_SPACE: Type = -3;
    #[doc = " The requested value has no value"]
    pub const NO_VALUE: Type = -4;
}
#[doc = " A borrowed byte string (pointer + length).\n\n The memory is not owned by this struct. The pointer is only valid\n for the lifetime documented by the API that produces or consumes it."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct String {
    #[doc = " Pointer to the string bytes."]
    pub ptr: *const u8,
    #[doc = " Length of the string in bytes."]
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of String"][::std::mem::size_of::<String>() - 16usize];
    ["Alignment of String"][::std::mem::align_of::<String>() - 8usize];
    ["Offset of field: String::ptr"][::std::mem::offset_of!(String, ptr) - 0usize];
    ["Offset of field: String::len"][::std::mem::offset_of!(String, len) - 8usize];
};
impl Default for String {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Function table for custom memory allocator operations.\n\n This vtable defines the interface for a custom memory allocator. All\n function pointers must be valid and non-NULL.\n\n\n If you're not going to use a custom allocator, you can ignore all of\n this. All functions that take an allocator pointer allow NULL to use a\n default allocator.\n\n The interface is based on the Zig allocator interface. I'll say up front\n that it is easy to look at this interface and think \"wow, this is really\n overcomplicated\". The reason for this complexity is well thought out by\n the Zig folks, and it enables a diverse set of allocation strategies\n as shown by the Zig ecosystem. As a consolation, please note that many\n of the arguments are only needed for advanced use cases and can be\n safely ignored in simple implementations. For example, if you look at\n the Zig implementation of the libc allocator in `lib/std/heap.zig`\n (search for CAllocator), you'll see it is very simple.\n\n We chose to align with the Zig allocator interface because:\n\n   1. It is a proven interface that serves a wide variety of use cases\n      in the real world via the Zig ecosystem. It's shown to work.\n\n   2. Our core implementation itself is Zig, and this lets us very\n      cheaply and easily convert between C and Zig allocators.\n\n NOTE(mitchellh): In the future, we can have default implementations of\n resize/remap and allow those to be null."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct AllocatorVtable {
    #[doc = " Return a pointer to `len` bytes with specified `alignment`, or return\n `NULL` indicating the allocation failed.\n\n   be a power of two between 1 and 16 inclusive."]
    pub alloc: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            len: usize,
            alignment: u8,
            ret_addr: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Attempt to expand or shrink memory in place.\n\n `memory_len` must equal the length requested from the most recent\n successful call to `alloc`, `resize`, or `remap`. `alignment` must\n equal the same value that was passed as the `alignment` parameter to\n the original `alloc` call.\n\n `new_len` must be greater than zero.\n"]
    pub resize: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            memory: *mut ::std::os::raw::c_void,
            memory_len: usize,
            alignment: u8,
            new_len: usize,
            ret_addr: usize,
        ) -> bool,
    >,
    #[doc = " Attempt to expand or shrink memory, allowing relocation.\n\n `memory_len` must equal the length requested from the most recent\n successful call to `alloc`, `resize`, or `remap`. `alignment` must\n equal the same value that was passed as the `alignment` parameter to\n the original `alloc` call.\n\n A non-`NULL` return value indicates the resize was successful. The\n allocation may have same address, or may have been relocated. In either\n case, the allocation now has size of `new_len`. A `NULL` return value\n indicates that the resize would be equivalent to allocating new memory,\n copying the bytes from the old memory, and then freeing the old memory.\n In such case, it is more efficient for the caller to perform the copy.\n\n `new_len` must be greater than zero.\n"]
    pub remap: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            memory: *mut ::std::os::raw::c_void,
            memory_len: usize,
            alignment: u8,
            new_len: usize,
            ret_addr: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Free and invalidate a region of memory.\n\n `memory_len` must equal the length requested from the most recent\n successful call to `alloc`, `resize`, or `remap`. `alignment` must\n equal the same value that was passed as the `alignment` parameter to\n the original `alloc` call.\n"]
    pub free: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut ::std::os::raw::c_void,
            memory: *mut ::std::os::raw::c_void,
            memory_len: usize,
            alignment: u8,
            ret_addr: usize,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AllocatorVtable"][::std::mem::size_of::<AllocatorVtable>() - 32usize];
    ["Alignment of AllocatorVtable"][::std::mem::align_of::<AllocatorVtable>() - 8usize];
    ["Offset of field: AllocatorVtable::alloc"]
        [::std::mem::offset_of!(AllocatorVtable, alloc) - 0usize];
    ["Offset of field: AllocatorVtable::resize"]
        [::std::mem::offset_of!(AllocatorVtable, resize) - 8usize];
    ["Offset of field: AllocatorVtable::remap"]
        [::std::mem::offset_of!(AllocatorVtable, remap) - 16usize];
    ["Offset of field: AllocatorVtable::free"]
        [::std::mem::offset_of!(AllocatorVtable, free) - 24usize];
};
#[doc = " Custom memory allocator.\n\n For functions that take an allocator pointer, a NULL pointer indicates\n that the default allocator should be used. The default allocator will\n be libc malloc/free if we're linking to libc. If libc isn't linked,\n a custom allocator is used (currently Zig's SMP allocator).\n\n\n Usage example:\n GhosttyAllocator allocator = {\n     .vtable = &my_allocator_vtable,\n     .ctx = my_allocator_state\n };"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Allocator {
    #[doc = " Opaque context pointer passed to all vtable functions.\n This allows the allocator implementation to maintain state\n or reference external resources needed for memory management."]
    pub ctx: *mut ::std::os::raw::c_void,
    #[doc = " Pointer to the allocator's vtable containing function pointers\n for memory operations (alloc, resize, remap, free)."]
    pub vtable: *const AllocatorVtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Allocator"][::std::mem::size_of::<Allocator>() - 16usize];
    ["Alignment of Allocator"][::std::mem::align_of::<Allocator>() - 8usize];
    ["Offset of field: Allocator::ctx"][::std::mem::offset_of!(Allocator, ctx) - 0usize];
    ["Offset of field: Allocator::vtable"][::std::mem::offset_of!(Allocator, vtable) - 8usize];
};
impl Default for Allocator {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Allocate a buffer of `len` bytes.\n\n Uses the provided allocator, or the default allocator if NULL is passed.\n The returned buffer must be freed with ghostty_free() using the same\n allocator.\n\n"]
    pub fn ghostty_alloc(allocator: *const Allocator, len: usize) -> *mut u8;
}
unsafe extern "C" {
    #[doc = " Free memory that was allocated by a libghostty-vt function.\n\n Use this to free buffers returned by functions such as\n ghostty_formatter_format_alloc(). Pass the same allocator that was\n used for the allocation, or NULL if the default allocator was used.\n\n On platforms where the library's internal allocator differs from the\n consumer's C runtime (e.g. Windows, where Zig's libc and MSVC's CRT\n maintain separate heaps), calling the standard C free() on memory\n allocated by the library causes undefined behavior. This function\n guarantees the correct allocator is used regardless of platform.\n\n It is safe to pass a NULL pointer; the call is a no-op in that case.\n\n   memory, or NULL if the default allocator was used\n   allocation size)\n"]
    pub fn ghostty_free(allocator: *const Allocator, ptr: *mut u8, len: usize);
}
pub mod OptimizeMode {
    #[doc = " Build optimization mode."]
    pub type Type = ::std::os::raw::c_uint;
    pub const DEBUG: Type = 0;
    pub const RELEASE_SAFE: Type = 1;
    pub const RELEASE_SMALL: Type = 2;
    pub const RELEASE_FAST: Type = 3;
}
pub mod BuildInfo {
    #[doc = " Build info data types that can be queried.\n\n Each variant documents the expected output pointer type."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid data type. Never results in any data extraction."]
    pub const INVALID: Type = 0;
    #[doc = " Whether SIMD-accelerated code paths are enabled.\n\n Output type: bool *"]
    pub const SIMD: Type = 1;
    #[doc = " Whether Kitty graphics protocol support is available.\n\n Output type: bool *"]
    pub const KITTY_GRAPHICS: Type = 2;
    #[doc = " Whether tmux control mode support is available.\n\n Output type: bool *"]
    pub const TMUX_CONTROL_MODE: Type = 3;
    #[doc = " The optimization mode the library was built with.\n\n Output type: GhosttyOptimizeMode *"]
    pub const OPTIMIZE: Type = 4;
    #[doc = " The full version string (e.g. \"1.2.3\" or \"1.2.3-dev+abcdef\").\n\n Output type: GhosttyString *"]
    pub const VERSION_STRING: Type = 5;
    #[doc = " The major version number.\n\n Output type: size_t *"]
    pub const VERSION_MAJOR: Type = 6;
    #[doc = " The minor version number.\n\n Output type: size_t *"]
    pub const VERSION_MINOR: Type = 7;
    #[doc = " The patch version number.\n\n Output type: size_t *"]
    pub const VERSION_PATCH: Type = 8;
    #[doc = " The build metadata string (e.g. commit hash). Has zero length if\n no build metadata is present.\n\n Output type: GhosttyString *"]
    pub const VERSION_BUILD: Type = 9;
}
unsafe extern "C" {
    #[doc = " Query a compile-time build configuration value.\n\n The caller must pass a pointer to the correct output type for the\n requested data (see GhosttyBuildInfo variants for types).\n\n         data type is invalid\n"]
    pub fn ghostty_build_info(
        data: BuildInfo::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
#[doc = " RGB color value.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ColorRgb {
    #[doc = "< Red component (0-255)"]
    pub r: u8,
    #[doc = "< Green component (0-255)"]
    pub g: u8,
    #[doc = "< Blue component (0-255)"]
    pub b: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorRgb"][::std::mem::size_of::<ColorRgb>() - 3usize];
    ["Alignment of ColorRgb"][::std::mem::align_of::<ColorRgb>() - 1usize];
    ["Offset of field: ColorRgb::r"][::std::mem::offset_of!(ColorRgb, r) - 0usize];
    ["Offset of field: ColorRgb::g"][::std::mem::offset_of!(ColorRgb, g) - 1usize];
    ["Offset of field: ColorRgb::b"][::std::mem::offset_of!(ColorRgb, b) - 2usize];
};
#[doc = " Palette color index (0-255).\n"]
pub type ColorPaletteIndex = u8;
unsafe extern "C" {
    #[doc = " Get the RGB color components.\n\n This function extracts the individual red, green, and blue components\n from a GhosttyColorRgb value. Primarily useful in WebAssembly environments\n where accessing struct fields directly is difficult.\n\n"]
    pub fn ghostty_color_rgb_get(color: ColorRgb, r: *mut u8, g: *mut u8, b: *mut u8);
}
pub mod ColorScheme {
    #[doc = " Color scheme reported in response to a CSI ? 996 n query.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const LIGHT: Type = 0;
    pub const DARK: Type = 1;
}
#[doc = " Primary device attributes (DA1) response data.\n\n Returned as part of GhosttyDeviceAttributes in response to a CSI c query.\n The conformance_level is the Pp parameter and features contains the Ps\n feature codes.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceAttributesPrimary {
    #[doc = " Conformance level (Pp parameter). E.g. 62 for VT220."]
    pub conformance_level: u16,
    #[doc = " DA1 feature codes. Only the first num_features entries are valid."]
    pub features: [u16; 64usize],
    #[doc = " Number of valid entries in the features array."]
    pub num_features: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceAttributesPrimary"]
        [::std::mem::size_of::<DeviceAttributesPrimary>() - 144usize];
    ["Alignment of DeviceAttributesPrimary"]
        [::std::mem::align_of::<DeviceAttributesPrimary>() - 8usize];
    ["Offset of field: DeviceAttributesPrimary::conformance_level"]
        [::std::mem::offset_of!(DeviceAttributesPrimary, conformance_level) - 0usize];
    ["Offset of field: DeviceAttributesPrimary::features"]
        [::std::mem::offset_of!(DeviceAttributesPrimary, features) - 2usize];
    ["Offset of field: DeviceAttributesPrimary::num_features"]
        [::std::mem::offset_of!(DeviceAttributesPrimary, num_features) - 136usize];
};
impl Default for DeviceAttributesPrimary {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Secondary device attributes (DA2) response data.\n\n Returned as part of GhosttyDeviceAttributes in response to a CSI > c query.\n Response format: CSI > Pp ; Pv ; Pc c\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DeviceAttributesSecondary {
    #[doc = " Terminal type identifier (Pp). E.g. 1 for VT220."]
    pub device_type: u16,
    #[doc = " Firmware/patch version number (Pv)."]
    pub firmware_version: u16,
    #[doc = " ROM cartridge registration number (Pc). Always 0 for emulators."]
    pub rom_cartridge: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceAttributesSecondary"]
        [::std::mem::size_of::<DeviceAttributesSecondary>() - 6usize];
    ["Alignment of DeviceAttributesSecondary"]
        [::std::mem::align_of::<DeviceAttributesSecondary>() - 2usize];
    ["Offset of field: DeviceAttributesSecondary::device_type"]
        [::std::mem::offset_of!(DeviceAttributesSecondary, device_type) - 0usize];
    ["Offset of field: DeviceAttributesSecondary::firmware_version"]
        [::std::mem::offset_of!(DeviceAttributesSecondary, firmware_version) - 2usize];
    ["Offset of field: DeviceAttributesSecondary::rom_cartridge"]
        [::std::mem::offset_of!(DeviceAttributesSecondary, rom_cartridge) - 4usize];
};
#[doc = " Tertiary device attributes (DA3) response data.\n\n Returned as part of GhosttyDeviceAttributes in response to a CSI = c query.\n Response format: DCS ! | D...D ST (DECRPTUI).\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DeviceAttributesTertiary {
    #[doc = " Unit ID encoded as 8 uppercase hex digits in the response."]
    pub unit_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceAttributesTertiary"]
        [::std::mem::size_of::<DeviceAttributesTertiary>() - 4usize];
    ["Alignment of DeviceAttributesTertiary"]
        [::std::mem::align_of::<DeviceAttributesTertiary>() - 4usize];
    ["Offset of field: DeviceAttributesTertiary::unit_id"]
        [::std::mem::offset_of!(DeviceAttributesTertiary, unit_id) - 0usize];
};
#[doc = " Device attributes response data for all three DA levels.\n\n Filled by the device_attributes callback in response to CSI c,\n CSI > c, or CSI = c queries. The terminal uses whichever sub-struct\n matches the request type.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceAttributes {
    pub primary: DeviceAttributesPrimary,
    pub secondary: DeviceAttributesSecondary,
    pub tertiary: DeviceAttributesTertiary,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceAttributes"][::std::mem::size_of::<DeviceAttributes>() - 160usize];
    ["Alignment of DeviceAttributes"][::std::mem::align_of::<DeviceAttributes>() - 8usize];
    ["Offset of field: DeviceAttributes::primary"]
        [::std::mem::offset_of!(DeviceAttributes, primary) - 0usize];
    ["Offset of field: DeviceAttributes::secondary"]
        [::std::mem::offset_of!(DeviceAttributes, secondary) - 144usize];
    ["Offset of field: DeviceAttributes::tertiary"]
        [::std::mem::offset_of!(DeviceAttributes, tertiary) - 152usize];
};
impl Default for DeviceAttributes {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub mod FocusEvent {
    #[doc = " Focus event types for focus reporting mode (mode 1004)."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Terminal window gained focus"]
    pub const GAINED: Type = 0;
    #[doc = " Terminal window lost focus"]
    pub const LOST: Type = 1;
}
unsafe extern "C" {
    #[doc = " Encode a focus event into a terminal escape sequence.\n\n Encodes a focus gained (CSI I) or focus lost (CSI O) report into the\n provided buffer.\n\n If the buffer is too small, the function returns GHOSTTY_OUT_OF_SPACE\n and writes the required buffer size to @p out_written. The caller can\n then retry with a sufficiently sized buffer.\n\n             GHOSTTY_OUT_OF_SPACE, the required buffer size.\n         is too small"]
    pub fn ghostty_focus_encode(
        event: FocusEvent::Type,
        buf: *mut ::std::os::raw::c_char,
        buf_len: usize,
        out_written: *mut usize,
    ) -> Result::Type;
}
#[doc = " A packed 16-bit terminal mode.\n\n Encodes a mode value (bits 0–14) and an ANSI flag (bit 15) into a\n single 16-bit integer. Use the inline helper functions to construct\n and inspect modes rather than manipulating bits directly."]
pub type Mode = u16;
pub mod ModeReportState {
    #[doc = " DECRPM report state values.\n\n These correspond to the Ps2 parameter in a DECRPM response\n sequence (CSI ? Ps1 ; Ps2 $ y)."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Mode is not recognized"]
    pub const NOT_RECOGNIZED: Type = 0;
    #[doc = " Mode is set (enabled)"]
    pub const SET: Type = 1;
    #[doc = " Mode is reset (disabled)"]
    pub const RESET: Type = 2;
    #[doc = " Mode is permanently set"]
    pub const PERMANENTLY_SET: Type = 3;
    #[doc = " Mode is permanently reset"]
    pub const PERMANENTLY_RESET: Type = 4;
}
unsafe extern "C" {
    #[doc = " Encode a DECRPM (DEC Private Mode Report) response sequence.\n\n Writes a mode report escape sequence into the provided buffer.\n The generated sequence has the form:\n - DEC private mode: CSI ? Ps1 ; Ps2 $ y\n - ANSI mode:        CSI Ps1 ; Ps2 $ y\n\n If the buffer is too small, the function returns GHOSTTY_OUT_OF_SPACE\n and writes the required buffer size to @p out_written. The caller can\n then retry with a sufficiently sized buffer.\n\n             GHOSTTY_OUT_OF_SPACE, the required buffer size.\n         is too small"]
    pub fn ghostty_mode_report_encode(
        mode: Mode,
        state: ModeReportState::Type,
        buf: *mut ::std::os::raw::c_char,
        buf_len: usize,
        out_written: *mut usize,
    ) -> Result::Type;
}
pub mod SizeReportStyle {
    #[doc = " Size report style.\n\n Determines the output format for the terminal size report."]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " In-band size report (mode 2048): ESC [ 48 ; rows ; cols ; height ; width t"]
    pub const MODE_2048: Type = 0;
    #[doc = " XTWINOPS text area size in pixels: ESC [ 4 ; height ; width t"]
    pub const CSI_14_T: Type = 1;
    #[doc = " XTWINOPS cell size in pixels: ESC [ 6 ; height ; width t"]
    pub const CSI_16_T: Type = 2;
    #[doc = " XTWINOPS text area size in characters: ESC [ 8 ; rows ; cols t"]
    pub const CSI_18_T: Type = 3;
}
#[doc = " Terminal size information for encoding size reports."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SizeReportSize {
    #[doc = " Terminal row count in cells."]
    pub rows: u16,
    #[doc = " Terminal column count in cells."]
    pub columns: u16,
    #[doc = " Width of a single terminal cell in pixels."]
    pub cell_width: u32,
    #[doc = " Height of a single terminal cell in pixels."]
    pub cell_height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SizeReportSize"][::std::mem::size_of::<SizeReportSize>() - 12usize];
    ["Alignment of SizeReportSize"][::std::mem::align_of::<SizeReportSize>() - 4usize];
    ["Offset of field: SizeReportSize::rows"]
        [::std::mem::offset_of!(SizeReportSize, rows) - 0usize];
    ["Offset of field: SizeReportSize::columns"]
        [::std::mem::offset_of!(SizeReportSize, columns) - 2usize];
    ["Offset of field: SizeReportSize::cell_width"]
        [::std::mem::offset_of!(SizeReportSize, cell_width) - 4usize];
    ["Offset of field: SizeReportSize::cell_height"]
        [::std::mem::offset_of!(SizeReportSize, cell_height) - 8usize];
};
unsafe extern "C" {
    #[doc = " Encode a terminal size report into an escape sequence.\n\n Encodes a size report in the format specified by @p style into the\n provided buffer.\n\n If the buffer is too small, the function returns GHOSTTY_OUT_OF_SPACE\n and writes the required buffer size to @p out_written. The caller can\n then retry with a sufficiently sized buffer.\n\n             GHOSTTY_OUT_OF_SPACE, the required buffer size.\n         is too small"]
    pub fn ghostty_size_report_encode(
        style: SizeReportStyle::Type,
        size: SizeReportSize,
        buf: *mut ::std::os::raw::c_char,
        buf_len: usize,
        out_written: *mut usize,
    ) -> Result::Type;
}
#[doc = " Opaque cell value.\n\n Represents a single terminal cell. The internal layout is opaque and\n must be queried via ghostty_cell_get(). Obtain cell values from\n terminal query APIs.\n"]
pub type Cell = u64;
#[doc = " Opaque row value.\n\n Represents a single terminal row. The internal layout is opaque and\n must be queried via ghostty_row_get(). Obtain row values from\n terminal query APIs.\n"]
pub type Row = u64;
pub mod CellContentTag {
    #[doc = " Cell content tag.\n\n Describes what kind of content a cell holds.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " A single codepoint (may be zero for empty)."]
    pub const CODEPOINT: Type = 0;
    #[doc = " A codepoint that is part of a multi-codepoint grapheme cluster."]
    pub const CODEPOINT_GRAPHEME: Type = 1;
    #[doc = " No text; background color from palette."]
    pub const BG_COLOR_PALETTE: Type = 2;
    #[doc = " No text; background color as RGB."]
    pub const BG_COLOR_RGB: Type = 3;
}
pub mod CellWide {
    #[doc = " Cell wide property.\n\n Describes the width behavior of a cell.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Not a wide character, cell width 1."]
    pub const NARROW: Type = 0;
    #[doc = " Wide character, cell width 2."]
    pub const WIDE: Type = 1;
    #[doc = " Spacer after wide character. Do not render."]
    pub const SPACER_TAIL: Type = 2;
    #[doc = " Spacer at end of soft-wrapped line for a wide character."]
    pub const SPACER_HEAD: Type = 3;
}
pub mod CellSemanticContent {
    #[doc = " Semantic content type of a cell.\n\n Set by semantic prompt sequences (OSC 133) to distinguish between\n command output, user input, and shell prompt text.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Regular output content, such as command output."]
    pub const OUTPUT: Type = 0;
    #[doc = " Content that is part of user input."]
    pub const INPUT: Type = 1;
    #[doc = " Content that is part of a shell prompt."]
    pub const PROMPT: Type = 2;
}
pub mod CellData {
    #[doc = " Cell data types.\n\n These values specify what type of data to extract from a cell\n using `ghostty_cell_get`.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid data type. Never results in any data extraction."]
    pub const INVALID: Type = 0;
    #[doc = " The codepoint of the cell (0 if empty or bg-color-only).\n\n Output type: uint32_t *"]
    pub const CODEPOINT: Type = 1;
    #[doc = " The content tag describing what kind of content is in the cell.\n\n Output type: GhosttyCellContentTag *"]
    pub const CONTENT_TAG: Type = 2;
    #[doc = " The wide property of the cell.\n\n Output type: GhosttyCellWide *"]
    pub const WIDE: Type = 3;
    #[doc = " Whether the cell has text to render.\n\n Output type: bool *"]
    pub const HAS_TEXT: Type = 4;
    #[doc = " Whether the cell has non-default styling.\n\n Output type: bool *"]
    pub const HAS_STYLING: Type = 5;
    #[doc = " The style ID for the cell (for use with style lookups).\n\n Output type: uint16_t *"]
    pub const STYLE_ID: Type = 6;
    #[doc = " Whether the cell has a hyperlink.\n\n Output type: bool *"]
    pub const HAS_HYPERLINK: Type = 7;
    #[doc = " Whether the cell is protected.\n\n Output type: bool *"]
    pub const PROTECTED: Type = 8;
    #[doc = " The semantic content type of the cell (from OSC 133).\n\n Output type: GhosttyCellSemanticContent *"]
    pub const SEMANTIC_CONTENT: Type = 9;
    #[doc = " The palette index for the cell's background color.\n Only valid when content_tag is GHOSTTY_CELL_CONTENT_BG_COLOR_PALETTE.\n\n Output type: GhosttyColorPaletteIndex *"]
    pub const COLOR_PALETTE: Type = 10;
    #[doc = " The RGB value for the cell's background color.\n Only valid when content_tag is GHOSTTY_CELL_CONTENT_BG_COLOR_RGB.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_RGB: Type = 11;
}
pub mod RowSemanticPrompt {
    #[doc = " Row semantic prompt state.\n\n Indicates whether any cells in a row are part of a shell prompt,\n as reported by OSC 133 sequences.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " No prompt cells in this row."]
    pub const NONE: Type = 0;
    #[doc = " Prompt cells exist and this is a primary prompt line."]
    pub const PROMPT: Type = 1;
    #[doc = " Prompt cells exist and this is a continuation line."]
    pub const PROMPT_CONTINUATION: Type = 2;
}
pub mod RowData {
    #[doc = " Row data types.\n\n These values specify what type of data to extract from a row\n using `ghostty_row_get`.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid data type. Never results in any data extraction."]
    pub const INVALID: Type = 0;
    #[doc = " Whether this row is soft-wrapped.\n\n Output type: bool *"]
    pub const WRAP: Type = 1;
    #[doc = " Whether this row is a continuation of a soft-wrapped row.\n\n Output type: bool *"]
    pub const WRAP_CONTINUATION: Type = 2;
    #[doc = " Whether any cells in this row have grapheme clusters.\n\n Output type: bool *"]
    pub const GRAPHEME: Type = 3;
    #[doc = " Whether any cells in this row have styling (may have false positives).\n\n Output type: bool *"]
    pub const STYLED: Type = 4;
    #[doc = " Whether any cells in this row have hyperlinks (may have false positives).\n\n Output type: bool *"]
    pub const HYPERLINK: Type = 5;
    #[doc = " The semantic prompt state of this row.\n\n Output type: GhosttyRowSemanticPrompt *"]
    pub const SEMANTIC_PROMPT: Type = 6;
    #[doc = " Whether this row contains a Kitty virtual placeholder.\n\n Output type: bool *"]
    pub const KITTY_VIRTUAL_PLACEHOLDER: Type = 7;
    #[doc = " Whether this row is dirty and requires a redraw.\n\n Output type: bool *"]
    pub const DIRTY: Type = 8;
}
unsafe extern "C" {
    #[doc = " Get data from a cell.\n\n Extracts typed data from the given cell based on the specified\n data type. The output pointer must be of the appropriate type for the\n requested data kind. Valid data types and output types are documented\n in the `GhosttyCellData` enum.\n\n         data type is invalid\n"]
    pub fn ghostty_cell_get(
        cell: Cell,
        data: CellData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get data from a row.\n\n Extracts typed data from the given row based on the specified\n data type. The output pointer must be of the appropriate type for the\n requested data kind. Valid data types and output types are documented\n in the `GhosttyRowData` enum.\n\n         data type is invalid\n"]
    pub fn ghostty_row_get(
        row: Row,
        data: RowData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
#[doc = " Style identifier type.\n\n Used to look up the full style from a grid reference.\n Obtain this from a cell via GHOSTTY_CELL_DATA_STYLE_ID.\n"]
pub type StyleId = u16;
pub mod StyleColorTag {
    #[doc = " Style color tags.\n\n These values identify the type of color in a style color.\n Use the tag to determine which field in the color value union to access.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const NONE: Type = 0;
    pub const PALETTE: Type = 1;
    pub const RGB: Type = 2;
}
#[doc = " Style color value union.\n\n Use the tag to determine which field is active.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union StyleColorValue {
    pub palette: ColorPaletteIndex,
    pub rgb: ColorRgb,
    pub _padding: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StyleColorValue"][::std::mem::size_of::<StyleColorValue>() - 8usize];
    ["Alignment of StyleColorValue"][::std::mem::align_of::<StyleColorValue>() - 8usize];
    ["Offset of field: StyleColorValue::palette"]
        [::std::mem::offset_of!(StyleColorValue, palette) - 0usize];
    ["Offset of field: StyleColorValue::rgb"]
        [::std::mem::offset_of!(StyleColorValue, rgb) - 0usize];
    ["Offset of field: StyleColorValue::_padding"]
        [::std::mem::offset_of!(StyleColorValue, _padding) - 0usize];
};
impl Default for StyleColorValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Style color (tagged union).\n\n A color used in a style attribute. Can be unset (none), a palette\n index, or a direct RGB value.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct StyleColor {
    pub tag: StyleColorTag::Type,
    pub value: StyleColorValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StyleColor"][::std::mem::size_of::<StyleColor>() - 16usize];
    ["Alignment of StyleColor"][::std::mem::align_of::<StyleColor>() - 8usize];
    ["Offset of field: StyleColor::tag"][::std::mem::offset_of!(StyleColor, tag) - 0usize];
    ["Offset of field: StyleColor::value"][::std::mem::offset_of!(StyleColor, value) - 8usize];
};
impl Default for StyleColor {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Terminal cell style.\n\n Describes the complete visual style for a terminal cell, including\n foreground, background, and underline colors, as well as text\n decoration flags. The underline field uses the same values as\n GhosttySgrUnderline.\n\n This is a sized struct. Use GHOSTTY_INIT_SIZED() to initialize it.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Style {
    pub size: usize,
    pub fg_color: StyleColor,
    pub bg_color: StyleColor,
    pub underline_color: StyleColor,
    pub bold: bool,
    pub italic: bool,
    pub faint: bool,
    pub blink: bool,
    pub inverse: bool,
    pub invisible: bool,
    pub strikethrough: bool,
    pub overline: bool,
    #[doc = "< One of GHOSTTY_SGR_UNDERLINE_* values"]
    pub underline: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Style"][::std::mem::size_of::<Style>() - 72usize];
    ["Alignment of Style"][::std::mem::align_of::<Style>() - 8usize];
    ["Offset of field: Style::size"][::std::mem::offset_of!(Style, size) - 0usize];
    ["Offset of field: Style::fg_color"][::std::mem::offset_of!(Style, fg_color) - 8usize];
    ["Offset of field: Style::bg_color"][::std::mem::offset_of!(Style, bg_color) - 24usize];
    ["Offset of field: Style::underline_color"]
        [::std::mem::offset_of!(Style, underline_color) - 40usize];
    ["Offset of field: Style::bold"][::std::mem::offset_of!(Style, bold) - 56usize];
    ["Offset of field: Style::italic"][::std::mem::offset_of!(Style, italic) - 57usize];
    ["Offset of field: Style::faint"][::std::mem::offset_of!(Style, faint) - 58usize];
    ["Offset of field: Style::blink"][::std::mem::offset_of!(Style, blink) - 59usize];
    ["Offset of field: Style::inverse"][::std::mem::offset_of!(Style, inverse) - 60usize];
    ["Offset of field: Style::invisible"][::std::mem::offset_of!(Style, invisible) - 61usize];
    ["Offset of field: Style::strikethrough"]
        [::std::mem::offset_of!(Style, strikethrough) - 62usize];
    ["Offset of field: Style::overline"][::std::mem::offset_of!(Style, overline) - 63usize];
    ["Offset of field: Style::underline"][::std::mem::offset_of!(Style, underline) - 64usize];
};
impl Default for Style {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Get the default style.\n\n Initializes the style to the default values (no colors, no flags).\n\n"]
    pub fn ghostty_style_default(style: *mut Style);
}
unsafe extern "C" {
    #[doc = " Check if a style is the default style.\n\n Returns true if all colors are unset and all flags are off.\n\n"]
    pub fn ghostty_style_is_default(style: *const Style) -> bool;
}
#[doc = " A resolved reference to a terminal cell position.\n\n This is a sized struct. Use GHOSTTY_INIT_SIZED() to initialize it.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GridRef {
    pub size: usize,
    pub node: *mut ::std::os::raw::c_void,
    pub x: u16,
    pub y: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GridRef"][::std::mem::size_of::<GridRef>() - 24usize];
    ["Alignment of GridRef"][::std::mem::align_of::<GridRef>() - 8usize];
    ["Offset of field: GridRef::size"][::std::mem::offset_of!(GridRef, size) - 0usize];
    ["Offset of field: GridRef::node"][::std::mem::offset_of!(GridRef, node) - 8usize];
    ["Offset of field: GridRef::x"][::std::mem::offset_of!(GridRef, x) - 16usize];
    ["Offset of field: GridRef::y"][::std::mem::offset_of!(GridRef, y) - 18usize];
};
impl Default for GridRef {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Get the cell from a grid reference.\n\n         node is NULL\n"]
    pub fn ghostty_grid_ref_cell(ref_: *const GridRef, out_cell: *mut Cell) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get the row from a grid reference.\n\n         node is NULL\n"]
    pub fn ghostty_grid_ref_row(ref_: *const GridRef, out_row: *mut Row) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get the grapheme cluster codepoints for the cell at the grid reference's\n position.\n\n Writes the full grapheme cluster (the cell's primary codepoint followed by\n any combining codepoints) into the provided buffer. If the cell has no text,\n out_len is set to 0 and GHOSTTY_SUCCESS is returned.\n\n If the buffer is too small (or NULL), the function returns\n GHOSTTY_OUT_OF_SPACE and writes the required number of codepoints to\n out_len. The caller can then retry with a sufficiently sized buffer.\n\n             GHOSTTY_OUT_OF_SPACE, the required buffer size in codepoints.\n         node is NULL, GHOSTTY_OUT_OF_SPACE if the buffer is too small\n"]
    pub fn ghostty_grid_ref_graphemes(
        ref_: *const GridRef,
        buf: *mut u32,
        buf_len: usize,
        out_len: *mut usize,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get the style of the cell at the grid reference's position.\n\n         node is NULL\n"]
    pub fn ghostty_grid_ref_style(ref_: *const GridRef, out_style: *mut Style) -> Result::Type;
}
#[doc = " A coordinate in the terminal grid.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct PointCoordinate {
    #[doc = " Column (0-indexed)."]
    pub x: u16,
    #[doc = " Row (0-indexed). May exceed page size for screen/history tags."]
    pub y: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PointCoordinate"][::std::mem::size_of::<PointCoordinate>() - 8usize];
    ["Alignment of PointCoordinate"][::std::mem::align_of::<PointCoordinate>() - 4usize];
    ["Offset of field: PointCoordinate::x"][::std::mem::offset_of!(PointCoordinate, x) - 0usize];
    ["Offset of field: PointCoordinate::y"][::std::mem::offset_of!(PointCoordinate, y) - 4usize];
};
pub mod PointTag {
    #[doc = " Point reference tag.\n\n Determines which coordinate system a point uses.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Active area where the cursor can move."]
    pub const ACTIVE: Type = 0;
    #[doc = " Visible viewport (changes when scrolled)."]
    pub const VIEWPORT: Type = 1;
    #[doc = " Full screen including scrollback."]
    pub const SCREEN: Type = 2;
    #[doc = " Scrollback history only (before active area)."]
    pub const HISTORY: Type = 3;
}
#[doc = " Point value union.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union PointValue {
    #[doc = " Coordinate (used for all tag variants)."]
    pub coordinate: PointCoordinate,
    #[doc = " Padding for ABI compatibility. Do not use."]
    pub _padding: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PointValue"][::std::mem::size_of::<PointValue>() - 16usize];
    ["Alignment of PointValue"][::std::mem::align_of::<PointValue>() - 8usize];
    ["Offset of field: PointValue::coordinate"]
        [::std::mem::offset_of!(PointValue, coordinate) - 0usize];
    ["Offset of field: PointValue::_padding"]
        [::std::mem::offset_of!(PointValue, _padding) - 0usize];
};
impl Default for PointValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Tagged union for a point in the terminal grid.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Point {
    pub tag: PointTag::Type,
    pub value: PointValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Point"][::std::mem::size_of::<Point>() - 24usize];
    ["Alignment of Point"][::std::mem::align_of::<Point>() - 8usize];
    ["Offset of field: Point::tag"][::std::mem::offset_of!(Point, tag) - 0usize];
    ["Offset of field: Point::value"][::std::mem::offset_of!(Point, value) - 8usize];
};
impl Default for Point {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TerminalImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a terminal instance.\n"]
pub type Terminal = *mut TerminalImpl;
#[doc = " Terminal initialization options.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TerminalOptions {
    #[doc = " Terminal width in cells. Must be greater than zero."]
    pub cols: u16,
    #[doc = " Terminal height in cells. Must be greater than zero."]
    pub rows: u16,
    #[doc = " Maximum number of lines to keep in scrollback history."]
    pub max_scrollback: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TerminalOptions"][::std::mem::size_of::<TerminalOptions>() - 16usize];
    ["Alignment of TerminalOptions"][::std::mem::align_of::<TerminalOptions>() - 8usize];
    ["Offset of field: TerminalOptions::cols"]
        [::std::mem::offset_of!(TerminalOptions, cols) - 0usize];
    ["Offset of field: TerminalOptions::rows"]
        [::std::mem::offset_of!(TerminalOptions, rows) - 2usize];
    ["Offset of field: TerminalOptions::max_scrollback"]
        [::std::mem::offset_of!(TerminalOptions, max_scrollback) - 8usize];
};
pub mod TerminalScrollViewportTag {
    #[doc = " Scroll viewport behavior tag.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Scroll to the top of the scrollback."]
    pub const TOP: Type = 0;
    #[doc = " Scroll to the bottom (active area)."]
    pub const BOTTOM: Type = 1;
    #[doc = " Scroll by a delta amount (up is negative)."]
    pub const DELTA: Type = 2;
}
#[doc = " Scroll viewport value.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union TerminalScrollViewportValue {
    #[doc = " Scroll delta (only used with GHOSTTY_SCROLL_VIEWPORT_DELTA). Up is negative."]
    pub delta: isize,
    #[doc = " Padding for ABI compatibility. Do not use."]
    pub _padding: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TerminalScrollViewportValue"]
        [::std::mem::size_of::<TerminalScrollViewportValue>() - 16usize];
    ["Alignment of TerminalScrollViewportValue"]
        [::std::mem::align_of::<TerminalScrollViewportValue>() - 8usize];
    ["Offset of field: TerminalScrollViewportValue::delta"]
        [::std::mem::offset_of!(TerminalScrollViewportValue, delta) - 0usize];
    ["Offset of field: TerminalScrollViewportValue::_padding"]
        [::std::mem::offset_of!(TerminalScrollViewportValue, _padding) - 0usize];
};
impl Default for TerminalScrollViewportValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " Tagged union for scroll viewport behavior.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct TerminalScrollViewport {
    pub tag: TerminalScrollViewportTag::Type,
    pub value: TerminalScrollViewportValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TerminalScrollViewport"][::std::mem::size_of::<TerminalScrollViewport>() - 24usize];
    ["Alignment of TerminalScrollViewport"]
        [::std::mem::align_of::<TerminalScrollViewport>() - 8usize];
    ["Offset of field: TerminalScrollViewport::tag"]
        [::std::mem::offset_of!(TerminalScrollViewport, tag) - 0usize];
    ["Offset of field: TerminalScrollViewport::value"]
        [::std::mem::offset_of!(TerminalScrollViewport, value) - 8usize];
};
impl Default for TerminalScrollViewport {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub mod TerminalScreen {
    #[doc = " Terminal screen identifier.\n\n Identifies which screen buffer is active in the terminal.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " The primary (normal) screen."]
    pub const PRIMARY: Type = 0;
    #[doc = " The alternate screen."]
    pub const ALTERNATE: Type = 1;
}
#[doc = " Scrollbar state for the terminal viewport.\n\n Represents the scrollable area dimensions needed to render a scrollbar.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TerminalScrollbar {
    #[doc = " Total size of the scrollable area in rows."]
    pub total: u64,
    #[doc = " Offset into the total area that the viewport is at."]
    pub offset: u64,
    #[doc = " Length of the visible area in rows."]
    pub len: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TerminalScrollbar"][::std::mem::size_of::<TerminalScrollbar>() - 24usize];
    ["Alignment of TerminalScrollbar"][::std::mem::align_of::<TerminalScrollbar>() - 8usize];
    ["Offset of field: TerminalScrollbar::total"]
        [::std::mem::offset_of!(TerminalScrollbar, total) - 0usize];
    ["Offset of field: TerminalScrollbar::offset"]
        [::std::mem::offset_of!(TerminalScrollbar, offset) - 8usize];
    ["Offset of field: TerminalScrollbar::len"]
        [::std::mem::offset_of!(TerminalScrollbar, len) - 16usize];
};
#[doc = " Callback function type for bell.\n\n Called when the terminal receives a BEL character (0x07).\n\n"]
pub type TerminalBellFn = ::std::option::Option<
    unsafe extern "C" fn(terminal: Terminal, userdata: *mut ::std::os::raw::c_void),
>;
#[doc = " Callback function type for color scheme queries (CSI ? 996 n).\n\n Called when the terminal receives a color scheme device status report\n query. Return true and fill *out_scheme with the current color scheme,\n or return false to silently ignore the query.\n\n"]
pub type TerminalColorSchemeFn = ::std::option::Option<
    unsafe extern "C" fn(
        terminal: Terminal,
        userdata: *mut ::std::os::raw::c_void,
        out_scheme: *mut ColorScheme::Type,
    ) -> bool,
>;
#[doc = " Callback function type for device attributes queries (DA1/DA2/DA3).\n\n Called when the terminal receives a device attributes query (CSI c,\n CSI > c, or CSI = c). Return true and fill *out_attrs with the\n response data, or return false to silently ignore the query.\n\n The terminal uses whichever sub-struct (primary, secondary, tertiary)\n matches the request type, but all three should be filled for simplicity.\n\n"]
pub type TerminalDeviceAttributesFn = ::std::option::Option<
    unsafe extern "C" fn(
        terminal: Terminal,
        userdata: *mut ::std::os::raw::c_void,
        out_attrs: *mut DeviceAttributes,
    ) -> bool,
>;
#[doc = " Callback function type for enquiry (ENQ, 0x05).\n\n Called when the terminal receives an ENQ character. Return the\n response bytes as a GhosttyString. The memory must remain valid\n until the callback returns. Return a zero-length string to send\n no response.\n\n"]
pub type TerminalEnquiryFn = ::std::option::Option<
    unsafe extern "C" fn(terminal: Terminal, userdata: *mut ::std::os::raw::c_void) -> String,
>;
#[doc = " Callback function type for size queries (XTWINOPS).\n\n Called in response to XTWINOPS size queries (CSI 14/16/18 t).\n Return true and fill *out_size with the current terminal geometry,\n or return false to silently ignore the query.\n\n"]
pub type TerminalSizeFn = ::std::option::Option<
    unsafe extern "C" fn(
        terminal: Terminal,
        userdata: *mut ::std::os::raw::c_void,
        out_size: *mut SizeReportSize,
    ) -> bool,
>;
#[doc = " Callback function type for title_changed.\n\n Called when the terminal title changes via escape sequences\n (e.g. OSC 0 or OSC 2). The new title can be queried from the\n terminal after the callback returns.\n\n"]
pub type TerminalTitleChangedFn = ::std::option::Option<
    unsafe extern "C" fn(terminal: Terminal, userdata: *mut ::std::os::raw::c_void),
>;
#[doc = " Callback function type for write_pty.\n\n Called when the terminal needs to write data back to the pty, for\n example in response to a device status report or mode query. The\n data is only valid for the duration of the call; callers must copy\n it if it needs to persist.\n\n"]
pub type TerminalWritePtyFn = ::std::option::Option<
    unsafe extern "C" fn(
        terminal: Terminal,
        userdata: *mut ::std::os::raw::c_void,
        data: *const u8,
        len: usize,
    ),
>;
#[doc = " Callback function type for XTVERSION.\n\n Called when the terminal receives an XTVERSION query (CSI > q).\n Return the version string (e.g. \"myterm 1.0\") as a GhosttyString.\n The memory must remain valid until the callback returns. Return a\n zero-length string to report the default \"libghostty\" version.\n\n"]
pub type TerminalXtversionFn = ::std::option::Option<
    unsafe extern "C" fn(terminal: Terminal, userdata: *mut ::std::os::raw::c_void) -> String,
>;
pub mod TerminalOption {
    #[doc = " Terminal option identifiers.\n\n These values are used with ghostty_terminal_set() to configure\n terminal callbacks and associated state.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Opaque userdata pointer passed to all callbacks.\n\n Input type: void*"]
    pub const USERDATA: Type = 0;
    #[doc = " Callback invoked when the terminal needs to write data back\n to the pty (e.g. in response to a DECRQM query or device\n status report). Set to NULL to ignore such sequences.\n\n Input type: GhosttyTerminalWritePtyFn"]
    pub const WRITE_PTY: Type = 1;
    #[doc = " Callback invoked when the terminal receives a BEL character\n (0x07). Set to NULL to ignore bell events.\n\n Input type: GhosttyTerminalBellFn"]
    pub const BELL: Type = 2;
    #[doc = " Callback invoked when the terminal receives an ENQ character\n (0x05). Set to NULL to send no response.\n\n Input type: GhosttyTerminalEnquiryFn"]
    pub const ENQUIRY: Type = 3;
    #[doc = " Callback invoked when the terminal receives an XTVERSION query\n (CSI > q). Set to NULL to report the default \"libghostty\" string.\n\n Input type: GhosttyTerminalXtversionFn"]
    pub const XTVERSION: Type = 4;
    #[doc = " Callback invoked when the terminal title changes via escape\n sequences (e.g. OSC 0 or OSC 2). Set to NULL to ignore title\n change events.\n\n Input type: GhosttyTerminalTitleChangedFn"]
    pub const TITLE_CHANGED: Type = 5;
    #[doc = " Callback invoked in response to XTWINOPS size queries\n (CSI 14/16/18 t). Set to NULL to silently ignore size queries.\n\n Input type: GhosttyTerminalSizeFn"]
    pub const SIZE: Type = 6;
    #[doc = " Callback invoked in response to a color scheme device status\n report query (CSI ? 996 n). Return true and fill the out pointer\n to report the current scheme, or return false to silently ignore.\n Set to NULL to ignore color scheme queries.\n\n Input type: GhosttyTerminalColorSchemeFn"]
    pub const COLOR_SCHEME: Type = 7;
    #[doc = " Callback invoked in response to a device attributes query\n (CSI c, CSI > c, or CSI = c). Return true and fill the out\n pointer with response data, or return false to silently ignore.\n Set to NULL to ignore device attributes queries.\n\n Input type: GhosttyTerminalDeviceAttributesFn"]
    pub const DEVICE_ATTRIBUTES: Type = 8;
    #[doc = " Set the terminal title manually.\n\n The string data is copied into the terminal. A NULL value pointer\n clears the title (equivalent to setting an empty string).\n\n Input type: GhosttyString*"]
    pub const TITLE: Type = 9;
    #[doc = " Set the terminal working directory manually.\n\n The string data is copied into the terminal. A NULL value pointer\n clears the pwd (equivalent to setting an empty string).\n\n Input type: GhosttyString*"]
    pub const PWD: Type = 10;
    #[doc = " Set the default foreground color.\n\n A NULL value pointer clears the default (unset).\n\n Input type: GhosttyColorRgb*"]
    pub const COLOR_FOREGROUND: Type = 11;
    #[doc = " Set the default background color.\n\n A NULL value pointer clears the default (unset).\n\n Input type: GhosttyColorRgb*"]
    pub const COLOR_BACKGROUND: Type = 12;
    #[doc = " Set the default cursor color.\n\n A NULL value pointer clears the default (unset).\n\n Input type: GhosttyColorRgb*"]
    pub const COLOR_CURSOR: Type = 13;
    #[doc = " Set the default 256-color palette.\n\n The value must point to an array of exactly 256 GhosttyColorRgb values.\n A NULL value pointer resets to the built-in default palette.\n\n Input type: GhosttyColorRgb[256]*"]
    pub const COLOR_PALETTE: Type = 14;
}
pub mod TerminalData {
    #[doc = " Terminal data types.\n\n These values specify what type of data to extract from a terminal\n using `ghostty_terminal_get`.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid data type. Never results in any data extraction."]
    pub const INVALID: Type = 0;
    #[doc = " Terminal width in cells.\n\n Output type: uint16_t *"]
    pub const COLS: Type = 1;
    #[doc = " Terminal height in cells.\n\n Output type: uint16_t *"]
    pub const ROWS: Type = 2;
    #[doc = " Cursor column position (0-indexed).\n\n Output type: uint16_t *"]
    pub const CURSOR_X: Type = 3;
    #[doc = " Cursor row position within the active area (0-indexed).\n\n Output type: uint16_t *"]
    pub const CURSOR_Y: Type = 4;
    #[doc = " Whether the cursor has a pending wrap (next print will soft-wrap).\n\n Output type: bool *"]
    pub const CURSOR_PENDING_WRAP: Type = 5;
    #[doc = " The currently active screen.\n\n Output type: GhosttyTerminalScreen *"]
    pub const ACTIVE_SCREEN: Type = 6;
    #[doc = " Whether the cursor is visible (DEC mode 25).\n\n Output type: bool *"]
    pub const CURSOR_VISIBLE: Type = 7;
    #[doc = " Current Kitty keyboard protocol flags.\n\n Output type: GhosttyKittyKeyFlags * (uint8_t *)"]
    pub const KITTY_KEYBOARD_FLAGS: Type = 8;
    #[doc = " Scrollbar state for the terminal viewport.\n\n This may be expensive to calculate depending on where the viewport\n is (arbitrary pins are expensive). The caller should take care to only\n call this as needed and not too frequently.\n\n Output type: GhosttyTerminalScrollbar *"]
    pub const SCROLLBAR: Type = 9;
    #[doc = " The current SGR style of the cursor.\n\n This is the style that will be applied to newly printed characters.\n\n Output type: GhosttyStyle *"]
    pub const CURSOR_STYLE: Type = 10;
    #[doc = " Whether any mouse tracking mode is active.\n\n Returns true if any of the mouse tracking modes (X10, normal, button,\n or any-event) are enabled.\n\n Output type: bool *"]
    pub const MOUSE_TRACKING: Type = 11;
    #[doc = " The terminal title as set by escape sequences (e.g. OSC 0/2).\n\n Returns a borrowed string. The pointer is valid until the next call\n to ghostty_terminal_vt_write() or ghostty_terminal_reset(). An empty\n string (len=0) is returned when no title has been set.\n\n Output type: GhosttyString *"]
    pub const TITLE: Type = 12;
    #[doc = " The terminal's current working directory as set by escape sequences\n (e.g. OSC 7).\n\n Returns a borrowed string. The pointer is valid until the next call\n to ghostty_terminal_vt_write() or ghostty_terminal_reset(). An empty\n string (len=0) is returned when no pwd has been set.\n\n Output type: GhosttyString *"]
    pub const PWD: Type = 13;
    #[doc = " The total number of rows in the active screen including scrollback.\n\n Output type: size_t *"]
    pub const TOTAL_ROWS: Type = 14;
    #[doc = " The number of scrollback rows (total rows minus viewport rows).\n\n Output type: size_t *"]
    pub const SCROLLBACK_ROWS: Type = 15;
    #[doc = " The total width of the terminal in pixels.\n\n This is cols * cell_width_px as set by ghostty_terminal_resize().\n\n Output type: uint32_t *"]
    pub const WIDTH_PX: Type = 16;
    #[doc = " The total height of the terminal in pixels.\n\n This is rows * cell_height_px as set by ghostty_terminal_resize().\n\n Output type: uint32_t *"]
    pub const HEIGHT_PX: Type = 17;
    #[doc = " The effective foreground color (override or default).\n\n Returns GHOSTTY_NO_VALUE if no foreground color is set.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_FOREGROUND: Type = 18;
    #[doc = " The effective background color (override or default).\n\n Returns GHOSTTY_NO_VALUE if no background color is set.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_BACKGROUND: Type = 19;
    #[doc = " The effective cursor color (override or default).\n\n Returns GHOSTTY_NO_VALUE if no cursor color is set.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_CURSOR: Type = 20;
    #[doc = " The current 256-color palette.\n\n Output type: GhosttyColorRgb[256] *"]
    pub const COLOR_PALETTE: Type = 21;
    #[doc = " The default foreground color (ignoring any OSC override).\n\n Returns GHOSTTY_NO_VALUE if no default foreground color is set.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_FOREGROUND_DEFAULT: Type = 22;
    #[doc = " The default background color (ignoring any OSC override).\n\n Returns GHOSTTY_NO_VALUE if no default background color is set.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_BACKGROUND_DEFAULT: Type = 23;
    #[doc = " The default cursor color (ignoring any OSC override).\n\n Returns GHOSTTY_NO_VALUE if no default cursor color is set.\n\n Output type: GhosttyColorRgb *"]
    pub const COLOR_CURSOR_DEFAULT: Type = 24;
    #[doc = " The default 256-color palette (ignoring any OSC overrides).\n\n Output type: GhosttyColorRgb[256] *"]
    pub const COLOR_PALETTE_DEFAULT: Type = 25;
}
unsafe extern "C" {
    #[doc = " Create a new terminal instance.\n\n"]
    pub fn ghostty_terminal_new(
        allocator: *const Allocator,
        terminal: *mut Terminal,
        options: TerminalOptions,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a terminal instance.\n\n Releases all resources associated with the terminal. After this call,\n the terminal handle becomes invalid and must not be used.\n\n"]
    pub fn ghostty_terminal_free(terminal: Terminal);
}
unsafe extern "C" {
    #[doc = " Perform a full reset of the terminal (RIS).\n\n Resets all terminal state back to its initial configuration, including\n modes, scrollback, scrolling region, and screen contents. The terminal\n dimensions are preserved.\n\n"]
    pub fn ghostty_terminal_reset(terminal: Terminal);
}
unsafe extern "C" {
    #[doc = " Resize the terminal to the given dimensions.\n\n Changes the number of columns and rows in the terminal. The primary\n screen will reflow content if wraparound mode is enabled; the alternate\n screen does not reflow. If the dimensions are unchanged, this is a no-op.\n\n This also updates the terminal's pixel dimensions (used for image\n protocols and size reports), disables synchronized output mode (allowed\n by the spec so that resize results are shown immediately), and sends an\n in-band size report if mode 2048 is enabled.\n\n"]
    pub fn ghostty_terminal_resize(
        terminal: Terminal,
        cols: u16,
        rows: u16,
        cell_width_px: u32,
        cell_height_px: u32,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Set an option on the terminal.\n\n Configures terminal callbacks and associated state such as the\n write_pty callback and userdata pointer. The value is passed\n directly for pointer types (callbacks, userdata) or as a pointer\n to the value for non-pointer types (e.g. GhosttyString*).\n NULL clears the option to its default.\n\n Callbacks are invoked synchronously during ghostty_terminal_vt_write().\n Callbacks must not call ghostty_terminal_vt_write() on the same\n terminal (no reentrancy).\n\n              or NULL to clear the option\n"]
    pub fn ghostty_terminal_set(
        terminal: Terminal,
        option: TerminalOption::Type,
        value: *const ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Write VT-encoded data to the terminal for processing.\n\n Feeds raw bytes through the terminal's VT stream parser, updating\n terminal state accordingly. By default, sequences that require output\n (queries, device status reports) are silently ignored. Use\n ghostty_terminal_set() with GHOSTTY_TERMINAL_OPT_WRITE_PTY to install\n a callback that receives response data.\n\n This never fails. Any erroneous input or errors in processing the\n input are logged internally but do not cause this function to fail\n because this input is assumed to be untrusted and from an external\n source; so the primary goal is to keep the terminal state consistent and\n not allow malformed input to corrupt or crash.\n\n"]
    pub fn ghostty_terminal_vt_write(terminal: Terminal, data: *const u8, len: usize);
}
unsafe extern "C" {
    #[doc = " Scroll the terminal viewport.\n\n Scrolls the terminal's viewport according to the given behavior.\n When using GHOSTTY_SCROLL_VIEWPORT_DELTA, set the delta field in\n the value union to specify the number of rows to scroll (negative\n for up, positive for down). For other behaviors, the value is ignored.\n\n"]
    pub fn ghostty_terminal_scroll_viewport(terminal: Terminal, behavior: TerminalScrollViewport);
}
unsafe extern "C" {
    #[doc = " Get the current value of a terminal mode.\n\n Returns the value of the mode identified by the given mode.\n\n             if it is reset\n         is NULL or the mode does not correspond to a known mode\n"]
    pub fn ghostty_terminal_mode_get(
        terminal: Terminal,
        mode: Mode,
        out_value: *mut bool,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Set the value of a terminal mode.\n\n Sets the mode identified by the given mode to the specified value.\n\n         is NULL or the mode does not correspond to a known mode\n"]
    pub fn ghostty_terminal_mode_set(terminal: Terminal, mode: Mode, value: bool) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get data from a terminal instance.\n\n Extracts typed data from the given terminal based on the specified\n data type. The output pointer must be of the appropriate type for the\n requested data kind. Valid data types and output types are documented\n in the `GhosttyTerminalData` enum.\n\n         is NULL or the data type is invalid\n"]
    pub fn ghostty_terminal_get(
        terminal: Terminal,
        data: TerminalData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Resolve a point in the terminal grid to a grid reference.\n\n Resolves the given point (which can be in active, viewport, screen,\n or history coordinates) to a grid reference for that location. Use\n ghostty_grid_ref_cell() and ghostty_grid_ref_row() to extract the cell\n and row.\n\n Lookups using the `active` and `viewport` tags are fast. The `screen`\n and `history` tags may require traversing the full scrollback page list\n to resolve the y coordinate, so they can be expensive for large\n scrollback buffers.\n\n This function isn't meant to be used as the core of render loop. It\n isn't built to sustain the framerates needed for rendering large screens.\n Use the render state API for that. This API is instead meant for less\n strictly performance-sensitive use cases.\n\n         is NULL or the point is out of bounds\n"]
    pub fn ghostty_terminal_grid_ref(
        terminal: Terminal,
        point: Point,
        out_ref: *mut GridRef,
    ) -> Result::Type;
}
pub mod FormatterFormat {
    #[doc = " Output format.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Plain text (no escape sequences)."]
    pub const PLAIN: Type = 0;
    #[doc = " VT sequences preserving colors, styles, URLs, etc."]
    pub const VT: Type = 1;
    #[doc = " HTML with inline styles."]
    pub const HTML: Type = 2;
}
#[doc = " Extra screen state to include in styled output.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FormatterScreenExtra {
    #[doc = " Size of this struct in bytes. Must be set to sizeof(GhosttyFormatterScreenExtra)."]
    pub size: usize,
    #[doc = " Emit cursor position using CUP (CSI H)."]
    pub cursor: bool,
    #[doc = " Emit current SGR style state based on the cursor's active style_id."]
    pub style: bool,
    #[doc = " Emit current hyperlink state using OSC 8 sequences."]
    pub hyperlink: bool,
    #[doc = " Emit character protection mode using DECSCA."]
    pub protection: bool,
    #[doc = " Emit Kitty keyboard protocol state using CSI > u and CSI = sequences."]
    pub kitty_keyboard: bool,
    #[doc = " Emit character set designations and invocations."]
    pub charsets: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FormatterScreenExtra"][::std::mem::size_of::<FormatterScreenExtra>() - 16usize];
    ["Alignment of FormatterScreenExtra"][::std::mem::align_of::<FormatterScreenExtra>() - 8usize];
    ["Offset of field: FormatterScreenExtra::size"]
        [::std::mem::offset_of!(FormatterScreenExtra, size) - 0usize];
    ["Offset of field: FormatterScreenExtra::cursor"]
        [::std::mem::offset_of!(FormatterScreenExtra, cursor) - 8usize];
    ["Offset of field: FormatterScreenExtra::style"]
        [::std::mem::offset_of!(FormatterScreenExtra, style) - 9usize];
    ["Offset of field: FormatterScreenExtra::hyperlink"]
        [::std::mem::offset_of!(FormatterScreenExtra, hyperlink) - 10usize];
    ["Offset of field: FormatterScreenExtra::protection"]
        [::std::mem::offset_of!(FormatterScreenExtra, protection) - 11usize];
    ["Offset of field: FormatterScreenExtra::kitty_keyboard"]
        [::std::mem::offset_of!(FormatterScreenExtra, kitty_keyboard) - 12usize];
    ["Offset of field: FormatterScreenExtra::charsets"]
        [::std::mem::offset_of!(FormatterScreenExtra, charsets) - 13usize];
};
#[doc = " Extra terminal state to include in styled output.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct FormatterTerminalExtra {
    #[doc = " Size of this struct in bytes. Must be set to sizeof(GhosttyFormatterTerminalExtra)."]
    pub size: usize,
    #[doc = " Emit the palette using OSC 4 sequences."]
    pub palette: bool,
    #[doc = " Emit terminal modes that differ from their defaults using CSI h/l."]
    pub modes: bool,
    #[doc = " Emit scrolling region state using DECSTBM and DECSLRM sequences."]
    pub scrolling_region: bool,
    #[doc = " Emit tabstop positions by clearing all tabs and setting each one."]
    pub tabstops: bool,
    #[doc = " Emit the present working directory using OSC 7."]
    pub pwd: bool,
    #[doc = " Emit keyboard modes such as ModifyOtherKeys."]
    pub keyboard: bool,
    #[doc = " Screen-level extras."]
    pub screen: FormatterScreenExtra,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FormatterTerminalExtra"][::std::mem::size_of::<FormatterTerminalExtra>() - 32usize];
    ["Alignment of FormatterTerminalExtra"]
        [::std::mem::align_of::<FormatterTerminalExtra>() - 8usize];
    ["Offset of field: FormatterTerminalExtra::size"]
        [::std::mem::offset_of!(FormatterTerminalExtra, size) - 0usize];
    ["Offset of field: FormatterTerminalExtra::palette"]
        [::std::mem::offset_of!(FormatterTerminalExtra, palette) - 8usize];
    ["Offset of field: FormatterTerminalExtra::modes"]
        [::std::mem::offset_of!(FormatterTerminalExtra, modes) - 9usize];
    ["Offset of field: FormatterTerminalExtra::scrolling_region"]
        [::std::mem::offset_of!(FormatterTerminalExtra, scrolling_region) - 10usize];
    ["Offset of field: FormatterTerminalExtra::tabstops"]
        [::std::mem::offset_of!(FormatterTerminalExtra, tabstops) - 11usize];
    ["Offset of field: FormatterTerminalExtra::pwd"]
        [::std::mem::offset_of!(FormatterTerminalExtra, pwd) - 12usize];
    ["Offset of field: FormatterTerminalExtra::keyboard"]
        [::std::mem::offset_of!(FormatterTerminalExtra, keyboard) - 13usize];
    ["Offset of field: FormatterTerminalExtra::screen"]
        [::std::mem::offset_of!(FormatterTerminalExtra, screen) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FormatterImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a formatter instance.\n"]
pub type Formatter = *mut FormatterImpl;
#[doc = " Options for creating a terminal formatter.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FormatterTerminalOptions {
    #[doc = " Size of this struct in bytes. Must be set to sizeof(GhosttyFormatterTerminalOptions)."]
    pub size: usize,
    #[doc = " Output format to emit."]
    pub emit: FormatterFormat::Type,
    #[doc = " Whether to unwrap soft-wrapped lines."]
    pub unwrap: bool,
    #[doc = " Whether to trim trailing whitespace on non-blank lines."]
    pub trim: bool,
    #[doc = " Extra terminal state to include in styled output."]
    pub extra: FormatterTerminalExtra,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FormatterTerminalOptions"]
        [::std::mem::size_of::<FormatterTerminalOptions>() - 48usize];
    ["Alignment of FormatterTerminalOptions"]
        [::std::mem::align_of::<FormatterTerminalOptions>() - 8usize];
    ["Offset of field: FormatterTerminalOptions::size"]
        [::std::mem::offset_of!(FormatterTerminalOptions, size) - 0usize];
    ["Offset of field: FormatterTerminalOptions::emit"]
        [::std::mem::offset_of!(FormatterTerminalOptions, emit) - 8usize];
    ["Offset of field: FormatterTerminalOptions::unwrap"]
        [::std::mem::offset_of!(FormatterTerminalOptions, unwrap) - 12usize];
    ["Offset of field: FormatterTerminalOptions::trim"]
        [::std::mem::offset_of!(FormatterTerminalOptions, trim) - 13usize];
    ["Offset of field: FormatterTerminalOptions::extra"]
        [::std::mem::offset_of!(FormatterTerminalOptions, extra) - 16usize];
};
impl Default for FormatterTerminalOptions {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Create a formatter for a terminal's active screen.\n\n The terminal must outlive the formatter. The formatter stores a borrowed\n reference to the terminal and reads its current state on each format call.\n\n"]
    pub fn ghostty_formatter_terminal_new(
        allocator: *const Allocator,
        formatter: *mut Formatter,
        terminal: Terminal,
        options: FormatterTerminalOptions,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Run the formatter and produce output into the caller-provided buffer.\n\n Each call formats the current terminal state. Pass NULL for buf to\n query the required buffer size without writing any output; in that case\n out_written receives the required size and the return value is\n GHOSTTY_OUT_OF_SPACE.\n\n If the buffer is too small, returns GHOSTTY_OUT_OF_SPACE and sets\n out_written to the required size. The caller can then retry with a\n larger buffer.\n\n                    or the required size on failure\n"]
    pub fn ghostty_formatter_format_buf(
        formatter: Formatter,
        buf: *mut u8,
        buf_len: usize,
        out_written: *mut usize,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Run the formatter and return an allocated buffer with the output.\n\n Each call formats the current terminal state. The buffer is allocated\n using the provided allocator (or the default allocator if NULL).\n The caller is responsible for freeing the returned buffer with\n ghostty_free(), passing the same allocator (or NULL for the default)\n that was used for the allocation.\n\n         failure\n"]
    pub fn ghostty_formatter_format_alloc(
        formatter: Formatter,
        allocator: *const Allocator,
        out_ptr: *mut *mut u8,
        out_len: *mut usize,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a formatter instance.\n\n Releases all resources associated with the formatter. After this call,\n the formatter handle becomes invalid.\n\n"]
    pub fn ghostty_formatter_free(formatter: Formatter);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderStateImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a render state instance.\n"]
pub type RenderState = *mut RenderStateImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderStateRowIteratorImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a render-state row iterator.\n"]
pub type RenderStateRowIterator = *mut RenderStateRowIteratorImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderStateRowCellsImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to render-state row cells.\n"]
pub type RenderStateRowCells = *mut RenderStateRowCellsImpl;
pub mod RenderStateDirty {
    #[doc = " Dirty state of a render state after update.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Not dirty at all; rendering can be skipped."]
    pub const FALSE: Type = 0;
    #[doc = " Some rows changed; renderer can redraw incrementally."]
    pub const PARTIAL: Type = 1;
    #[doc = " Global state changed; renderer should redraw everything."]
    pub const FULL: Type = 2;
}
pub mod RenderStateCursorVisualStyle {
    #[doc = " Visual style of the cursor.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Bar cursor (DECSCUSR 5, 6)."]
    pub const BAR: Type = 0;
    #[doc = " Block cursor (DECSCUSR 1, 2)."]
    pub const BLOCK: Type = 1;
    #[doc = " Underline cursor (DECSCUSR 3, 4)."]
    pub const UNDERLINE: Type = 2;
    #[doc = " Hollow block cursor."]
    pub const BLOCK_HOLLOW: Type = 3;
}
pub mod RenderStateData {
    #[doc = " Queryable data kinds for ghostty_render_state_get().\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid / sentinel value."]
    pub const INVALID: Type = 0;
    #[doc = " Viewport width in cells (uint16_t)."]
    pub const COLS: Type = 1;
    #[doc = " Viewport height in cells (uint16_t)."]
    pub const ROWS: Type = 2;
    #[doc = " Current dirty state (GhosttyRenderStateDirty)."]
    pub const DIRTY: Type = 3;
    #[doc = " Populate a pre-allocated GhosttyRenderStateRowIterator with row data\n  from the render state (GhosttyRenderStateRowIterator). Row data is\n  only valid as long as the underlying render state is not updated.\n  It is unsafe to use row data after updating the render state."]
    pub const ROW_ITERATOR: Type = 4;
    #[doc = " Default/current background color (GhosttyColorRgb)."]
    pub const COLOR_BACKGROUND: Type = 5;
    #[doc = " Default/current foreground color (GhosttyColorRgb)."]
    pub const COLOR_FOREGROUND: Type = 6;
    #[doc = " Cursor color when explicitly set by terminal state (GhosttyColorRgb).\n  Returns GHOSTTY_INVALID_VALUE if no explicit cursor color is set;\n  use COLOR_CURSOR_HAS_VALUE to check first."]
    pub const COLOR_CURSOR: Type = 7;
    #[doc = " Whether an explicit cursor color is set (bool)."]
    pub const COLOR_CURSOR_HAS_VALUE: Type = 8;
    #[doc = " The active 256-color palette (GhosttyColorRgb[256])."]
    pub const COLOR_PALETTE: Type = 9;
    #[doc = " The visual style of the cursor (GhosttyRenderStateCursorVisualStyle)."]
    pub const CURSOR_VISUAL_STYLE: Type = 10;
    #[doc = " Whether the cursor is visible based on terminal modes (bool)."]
    pub const CURSOR_VISIBLE: Type = 11;
    #[doc = " Whether the cursor should blink based on terminal modes (bool)."]
    pub const CURSOR_BLINKING: Type = 12;
    #[doc = " Whether the cursor is at a password input field (bool)."]
    pub const CURSOR_PASSWORD_INPUT: Type = 13;
    #[doc = " Whether the cursor is visible within the viewport (bool).\n  If false, the cursor viewport position values are undefined."]
    pub const CURSOR_VIEWPORT_HAS_VALUE: Type = 14;
    #[doc = " Cursor viewport x position in cells (uint16_t).\n  Only valid when CURSOR_VIEWPORT_HAS_VALUE is true."]
    pub const CURSOR_VIEWPORT_X: Type = 15;
    #[doc = " Cursor viewport y position in cells (uint16_t).\n  Only valid when CURSOR_VIEWPORT_HAS_VALUE is true."]
    pub const CURSOR_VIEWPORT_Y: Type = 16;
    #[doc = " Whether the cursor is on the tail of a wide character (bool).\n  Only valid when CURSOR_VIEWPORT_HAS_VALUE is true."]
    pub const CURSOR_VIEWPORT_WIDE_TAIL: Type = 17;
}
pub mod RenderStateOption {
    #[doc = " Settable options for ghostty_render_state_set().\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Set dirty state (GhosttyRenderStateDirty)."]
    pub const DIRTY: Type = 0;
}
pub mod RenderStateRowData {
    #[doc = " Queryable data kinds for ghostty_render_state_row_get().\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid / sentinel value."]
    pub const INVALID: Type = 0;
    #[doc = " Whether the current row is dirty (bool)."]
    pub const DIRTY: Type = 1;
    #[doc = " The raw row value (GhosttyRow)."]
    pub const RAW: Type = 2;
    #[doc = " Populate a pre-allocated GhosttyRenderStateRowCells with cell data for\n  the current row (GhosttyRenderStateRowCells). Cell data is only\n  valid as long as the underlying render state is not updated.\n  It is unsafe to use cell data after updating the render state."]
    pub const CELLS: Type = 3;
}
pub mod RenderStateRowOption {
    #[doc = " Settable options for ghostty_render_state_row_set().\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Set dirty state for the current row (bool)."]
    pub const DIRTY: Type = 0;
}
#[doc = " Render-state color information.\n\n This struct uses the sized-struct ABI pattern. Initialize with\n GHOSTTY_INIT_SIZED(GhosttyRenderStateColors) before calling\n ghostty_render_state_colors_get().\n\n Example:\n GhosttyRenderStateColors colors = GHOSTTY_INIT_SIZED(GhosttyRenderStateColors);\n GhosttyResult result = ghostty_render_state_colors_get(state, &colors);\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RenderStateColors {
    #[doc = " Size of this struct in bytes. Must be set to sizeof(GhosttyRenderStateColors)."]
    pub size: usize,
    #[doc = " The default/current background color for the render state."]
    pub background: ColorRgb,
    #[doc = " The default/current foreground color for the render state."]
    pub foreground: ColorRgb,
    #[doc = " The cursor color when explicitly set by terminal state."]
    pub cursor: ColorRgb,
    #[doc = " True when cursor contains a valid explicit cursor color value.\n If this is false, the cursor color should be ignored; it will\n contain undefined data."]
    pub cursor_has_value: bool,
    #[doc = " The active 256-color palette for this render state."]
    pub palette: [ColorRgb; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RenderStateColors"][::std::mem::size_of::<RenderStateColors>() - 792usize];
    ["Alignment of RenderStateColors"][::std::mem::align_of::<RenderStateColors>() - 8usize];
    ["Offset of field: RenderStateColors::size"]
        [::std::mem::offset_of!(RenderStateColors, size) - 0usize];
    ["Offset of field: RenderStateColors::background"]
        [::std::mem::offset_of!(RenderStateColors, background) - 8usize];
    ["Offset of field: RenderStateColors::foreground"]
        [::std::mem::offset_of!(RenderStateColors, foreground) - 11usize];
    ["Offset of field: RenderStateColors::cursor"]
        [::std::mem::offset_of!(RenderStateColors, cursor) - 14usize];
    ["Offset of field: RenderStateColors::cursor_has_value"]
        [::std::mem::offset_of!(RenderStateColors, cursor_has_value) - 17usize];
    ["Offset of field: RenderStateColors::palette"]
        [::std::mem::offset_of!(RenderStateColors, palette) - 18usize];
};
impl Default for RenderStateColors {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Create a new render state instance.\n\n failure\n"]
    pub fn ghostty_render_state_new(
        allocator: *const Allocator,
        state: *mut RenderState,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a render state instance.\n\n Releases all resources associated with the render state. After this call,\n the render state handle becomes invalid.\n\n"]
    pub fn ghostty_render_state_free(state: RenderState);
}
unsafe extern "C" {
    #[doc = " Update a render state instance from a terminal.\n\n This consumes terminal/screen dirty state in the same way as the internal\n render state update path.\n\n `terminal` is NULL, GHOSTTY_OUT_OF_MEMORY if updating the state requires\n allocation and that allocation fails\n"]
    pub fn ghostty_render_state_update(state: RenderState, terminal: Terminal) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get a value from a render state.\n\n The `out` pointer must point to a value of the type corresponding to the\n requested data kind (see GhosttyRenderStateData).\n\n         NULL or `data` is not a recognized enum value\n"]
    pub fn ghostty_render_state_get(
        state: RenderState,
        data: RenderStateData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Set an option on a render state.\n\n The `value` pointer must point to a value of the type corresponding to the\n requested option kind (see GhosttyRenderStateOption).\n\n            GHOSTTY_INVALID_VALUE)\n         `value` is NULL\n"]
    pub fn ghostty_render_state_set(
        state: RenderState,
        option: RenderStateOption::Type,
        value: *const ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get the current color information from a render state.\n\n This writes as many fields as fit in the caller-provided sized struct.\n `out_colors->size` must be set by the caller (typically via\n GHOSTTY_INIT_SIZED(GhosttyRenderStateColors)).\n\n         `out_colors` is NULL, or if `out_colors->size` is smaller than\n         `sizeof(size_t)`\n"]
    pub fn ghostty_render_state_colors_get(
        state: RenderState,
        out_colors: *mut RenderStateColors,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Create a new row iterator instance.\n\n All fields except the allocator are left undefined until populated\n via ghostty_render_state_get() with\n GHOSTTY_RENDER_STATE_DATA_ROW_ITERATOR.\n\n         failure\n"]
    pub fn ghostty_render_state_row_iterator_new(
        allocator: *const Allocator,
        out_iterator: *mut RenderStateRowIterator,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a render-state row iterator.\n\n"]
    pub fn ghostty_render_state_row_iterator_free(iterator: RenderStateRowIterator);
}
unsafe extern "C" {
    #[doc = " Move a render-state row iterator to the next row.\n\n Returns true if the iterator moved successfully and row data is\n available to read at the new position.\n\n         NULL or if the iterator has reached the end\n"]
    pub fn ghostty_render_state_row_iterator_next(iterator: RenderStateRowIterator) -> bool;
}
unsafe extern "C" {
    #[doc = " Get a value from the current row in a render-state row iterator.\n\n The `out` pointer must point to a value of the type corresponding to the\n requested data kind (see GhosttyRenderStateRowData).\n Call ghostty_render_state_row_iterator_next() at least once before\n calling this function.\n\n         `iterator` is NULL or the iterator is not positioned on a row\n"]
    pub fn ghostty_render_state_row_get(
        iterator: RenderStateRowIterator,
        data: RenderStateRowData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Set an option on the current row in a render-state row iterator.\n\n The `value` pointer must point to a value of the type corresponding to the\n requested option kind (see GhosttyRenderStateRowOption).\n Call ghostty_render_state_row_iterator_next() at least once before\n calling this function.\n\n            GHOSTTY_INVALID_VALUE)\n         `iterator` is NULL or the iterator is not positioned on a row\n"]
    pub fn ghostty_render_state_row_set(
        iterator: RenderStateRowIterator,
        option: RenderStateRowOption::Type,
        value: *const ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Create a new row cells instance.\n\n All fields except the allocator are left undefined until populated\n via ghostty_render_state_row_get() with\n GHOSTTY_RENDER_STATE_ROW_DATA_CELLS.\n\n You can reuse this value repeatedly with ghostty_render_state_row_get() to\n avoid allocating a new cells container for every row.\n\n         failure\n"]
    pub fn ghostty_render_state_row_cells_new(
        allocator: *const Allocator,
        out_cells: *mut RenderStateRowCells,
    ) -> Result::Type;
}
pub mod RenderStateRowCellsData {
    #[doc = " Queryable data kinds for ghostty_render_state_row_cells_get().\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid / sentinel value."]
    pub const INVALID: Type = 0;
    #[doc = " The raw cell value (GhosttyCell)."]
    pub const RAW: Type = 1;
    #[doc = " The style for the current cell (GhosttyStyle)."]
    pub const STYLE: Type = 2;
    #[doc = " The total number of grapheme codepoints including the base codepoint\n  (uint32_t). Returns 0 if the cell has no text."]
    pub const GRAPHEMES_LEN: Type = 3;
    #[doc = " Write grapheme codepoints into a caller-provided buffer (uint32_t*).\n  The buffer must be at least graphemes_len elements. The base codepoint\n  is written first, followed by any extra codepoints."]
    pub const GRAPHEMES_BUF: Type = 4;
    #[doc = " The resolved background color of the cell (GhosttyColorRgb).\n  Flattens the three possible sources: content-tag bg_color_rgb,\n  content-tag bg_color_palette (looked up in the palette), or the\n  style's bg_color. Returns GHOSTTY_INVALID_VALUE if the cell has\n  no background color, in which case the caller should use whatever\n  default background color it wants (e.g. the terminal background)."]
    pub const BG_COLOR: Type = 5;
    #[doc = " The resolved foreground color of the cell (GhosttyColorRgb).\n  Resolves palette indices through the palette. Bold color handling\n  is not applied; the caller should handle bold styling separately.\n  Returns GHOSTTY_INVALID_VALUE if the cell has no explicit foreground\n  color, in which case the caller should use whatever default foreground\n  color it wants (e.g. the terminal foreground)."]
    pub const FG_COLOR: Type = 6;
}
unsafe extern "C" {
    #[doc = " Move a render-state row cells iterator to the next cell.\n\n Returns true if the iterator moved successfully and cell data is\n available to read at the new position.\n\n         NULL or if the iterator has reached the end\n"]
    pub fn ghostty_render_state_row_cells_next(cells: RenderStateRowCells) -> bool;
}
unsafe extern "C" {
    #[doc = " Move a render-state row cells iterator to a specific column.\n\n Positions the iterator at the given x (column) index so that\n subsequent reads return data for that cell.\n\n        GHOSTTY_INVALID_VALUE)\n         is NULL or `x` is out of range\n"]
    pub fn ghostty_render_state_row_cells_select(
        cells: RenderStateRowCells,
        x: u16,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get a value from the current cell in a render-state row cells iterator.\n\n The `out` pointer must point to a value of the type corresponding to the\n requested data kind (see GhosttyRenderStateRowCellsData).\n Call ghostty_render_state_row_cells_next() or\n ghostty_render_state_row_cells_select() at least once before\n calling this function.\n\n         `cells` is NULL or the iterator is not positioned on a cell\n"]
    pub fn ghostty_render_state_row_cells_get(
        cells: RenderStateRowCells,
        data: RenderStateRowCellsData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a row cells instance.\n\n"]
    pub fn ghostty_render_state_row_cells_free(cells: RenderStateRowCells);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OscParserImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to an OSC parser instance.\n\n This handle represents an OSC (Operating System Command) parser that can\n be used to parse the contents of OSC sequences.\n"]
pub type OscParser = *mut OscParserImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OscCommandImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a single OSC command.\n\n This handle represents a parsed OSC (Operating System Command) command.\n The command can be queried for its type and associated data.\n"]
pub type OscCommand = *mut OscCommandImpl;
pub mod OscCommandType {
    #[doc = " OSC command types.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const INVALID: Type = 0;
    pub const CHANGE_WINDOW_TITLE: Type = 1;
    pub const CHANGE_WINDOW_ICON: Type = 2;
    pub const SEMANTIC_PROMPT: Type = 3;
    pub const CLIPBOARD_CONTENTS: Type = 4;
    pub const REPORT_PWD: Type = 5;
    pub const MOUSE_SHAPE: Type = 6;
    pub const COLOR_OPERATION: Type = 7;
    pub const KITTY_COLOR_PROTOCOL: Type = 8;
    pub const SHOW_DESKTOP_NOTIFICATION: Type = 9;
    pub const HYPERLINK_START: Type = 10;
    pub const HYPERLINK_END: Type = 11;
    pub const CONEMU_SLEEP: Type = 12;
    pub const CONEMU_SHOW_MESSAGE_BOX: Type = 13;
    pub const CONEMU_CHANGE_TAB_TITLE: Type = 14;
    pub const CONEMU_PROGRESS_REPORT: Type = 15;
    pub const CONEMU_WAIT_INPUT: Type = 16;
    pub const CONEMU_GUIMACRO: Type = 17;
    pub const CONEMU_RUN_PROCESS: Type = 18;
    pub const CONEMU_OUTPUT_ENVIRONMENT_VARIABLE: Type = 19;
    pub const CONEMU_XTERM_EMULATION: Type = 20;
    pub const CONEMU_COMMENT: Type = 21;
    pub const KITTY_TEXT_SIZING: Type = 22;
}
pub mod OscCommandData {
    #[doc = " OSC command data types.\n\n These values specify what type of data to extract from an OSC command\n using `ghostty_osc_command_data`.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Invalid data type. Never results in any data extraction."]
    pub const INVALID: Type = 0;
    #[doc = " Window title string data.\n\n Valid for: GHOSTTY_OSC_COMMAND_CHANGE_WINDOW_TITLE\n\n Output type: const char ** (pointer to null-terminated string)\n\n Lifetime: Valid until the next call to any ghostty_osc_* function with\n the same parser instance. Memory is owned by the parser."]
    pub const CHANGE_WINDOW_TITLE_STR: Type = 1;
}
unsafe extern "C" {
    #[doc = " Create a new OSC parser instance.\n\n Creates a new OSC (Operating System Command) parser using the provided\n allocator. The parser must be freed using ghostty_vt_osc_free() when\n no longer needed.\n\n"]
    pub fn ghostty_osc_new(allocator: *const Allocator, parser: *mut OscParser) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free an OSC parser instance.\n\n Releases all resources associated with the OSC parser. After this call,\n the parser handle becomes invalid and must not be used.\n\n"]
    pub fn ghostty_osc_free(parser: OscParser);
}
unsafe extern "C" {
    #[doc = " Reset an OSC parser instance to its initial state.\n\n Resets the parser state, clearing any partially parsed OSC sequences\n and returning the parser to its initial state. This is useful for\n reusing a parser instance or recovering from parse errors.\n\n"]
    pub fn ghostty_osc_reset(parser: OscParser);
}
unsafe extern "C" {
    #[doc = " Parse the next byte in an OSC sequence.\n\n Processes a single byte as part of an OSC sequence. The parser maintains\n internal state to track the progress through the sequence. Call this\n function for each byte in the sequence data.\n\n When finished pumping the parser with bytes, call ghostty_osc_end\n to get the final result.\n\n"]
    pub fn ghostty_osc_next(parser: OscParser, byte: u8);
}
unsafe extern "C" {
    #[doc = " Finalize OSC parsing and retrieve the parsed command.\n\n Call this function after feeding all bytes of an OSC sequence to the parser\n using ghostty_osc_next() with the exception of the terminating character\n (ESC or ST). This function finalizes the parsing process and returns the\n parsed OSC command.\n\n The return value is never NULL. Invalid commands will return a command\n with type GHOSTTY_OSC_COMMAND_INVALID.\n\n The terminator parameter specifies the byte that terminated the OSC sequence\n (typically 0x07 for BEL or 0x5C for ST after ESC). This information is\n preserved in the parsed command so that responses can use the same terminator\n format for better compatibility with the calling program. For commands that\n do not require a response, this parameter is ignored and the resulting\n command will not retain the terminator information.\n\n The returned command handle is valid until the next call to any\n `ghostty_osc_*` function with the same parser instance with the exception\n of command introspection functions such as `ghostty_osc_command_type`.\n\n"]
    pub fn ghostty_osc_end(parser: OscParser, terminator: u8) -> OscCommand;
}
unsafe extern "C" {
    #[doc = " Get the type of an OSC command.\n\n Returns the type identifier for the given OSC command. This can be used\n to determine what kind of command was parsed and what data might be\n available from it.\n\n"]
    pub fn ghostty_osc_command_type(command: OscCommand) -> OscCommandType::Type;
}
unsafe extern "C" {
    #[doc = " Extract data from an OSC command.\n\n Extracts typed data from the given OSC command based on the specified\n data type. The output pointer must be of the appropriate type for the\n requested data kind. Valid command types, output types, and memory\n safety information are documented in the `GhosttyOscCommandData` enum.\n\n"]
    pub fn ghostty_osc_command_data(
        command: OscCommand,
        data: OscCommandData::Type,
        out: *mut ::std::os::raw::c_void,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SgrParserImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to an SGR parser instance.\n\n This handle represents an SGR (Select Graphic Rendition) parser that can\n be used to parse SGR sequences and extract individual text attributes.\n"]
pub type SgrParser = *mut SgrParserImpl;
pub mod SgrAttributeTag {
    #[doc = " SGR attribute tags.\n\n These values identify the type of an SGR attribute in a tagged union.\n Use the tag to determine which field in the attribute value union to access.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const UNSET: Type = 0;
    pub const UNKNOWN: Type = 1;
    pub const BOLD: Type = 2;
    pub const RESET_BOLD: Type = 3;
    pub const ITALIC: Type = 4;
    pub const RESET_ITALIC: Type = 5;
    pub const FAINT: Type = 6;
    pub const UNDERLINE: Type = 7;
    pub const UNDERLINE_COLOR: Type = 8;
    pub const UNDERLINE_COLOR_256: Type = 9;
    pub const RESET_UNDERLINE_COLOR: Type = 10;
    pub const OVERLINE: Type = 11;
    pub const RESET_OVERLINE: Type = 12;
    pub const BLINK: Type = 13;
    pub const RESET_BLINK: Type = 14;
    pub const INVERSE: Type = 15;
    pub const RESET_INVERSE: Type = 16;
    pub const INVISIBLE: Type = 17;
    pub const RESET_INVISIBLE: Type = 18;
    pub const STRIKETHROUGH: Type = 19;
    pub const RESET_STRIKETHROUGH: Type = 20;
    pub const DIRECT_COLOR_FG: Type = 21;
    pub const DIRECT_COLOR_BG: Type = 22;
    pub const BG_8: Type = 23;
    pub const FG_8: Type = 24;
    pub const RESET_FG: Type = 25;
    pub const RESET_BG: Type = 26;
    pub const BRIGHT_BG_8: Type = 27;
    pub const BRIGHT_FG_8: Type = 28;
    pub const BG_256: Type = 29;
    pub const FG_256: Type = 30;
}
pub mod SgrUnderline {
    #[doc = " Underline style types.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const NONE: Type = 0;
    pub const SINGLE: Type = 1;
    pub const DOUBLE: Type = 2;
    pub const CURLY: Type = 3;
    pub const DOTTED: Type = 4;
    pub const DASHED: Type = 5;
}
#[doc = " Unknown SGR attribute data.\n\n Contains the full parameter list and the partial list where parsing\n encountered an unknown or invalid sequence.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SgrUnknown {
    pub full_ptr: *const u16,
    pub full_len: usize,
    pub partial_ptr: *const u16,
    pub partial_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SgrUnknown"][::std::mem::size_of::<SgrUnknown>() - 32usize];
    ["Alignment of SgrUnknown"][::std::mem::align_of::<SgrUnknown>() - 8usize];
    ["Offset of field: SgrUnknown::full_ptr"]
        [::std::mem::offset_of!(SgrUnknown, full_ptr) - 0usize];
    ["Offset of field: SgrUnknown::full_len"]
        [::std::mem::offset_of!(SgrUnknown, full_len) - 8usize];
    ["Offset of field: SgrUnknown::partial_ptr"]
        [::std::mem::offset_of!(SgrUnknown, partial_ptr) - 16usize];
    ["Offset of field: SgrUnknown::partial_len"]
        [::std::mem::offset_of!(SgrUnknown, partial_len) - 24usize];
};
impl Default for SgrUnknown {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " SGR attribute value union.\n\n This union contains all possible attribute values. Use the tag field\n to determine which union member is active. Attributes without associated\n data (like bold, italic) don't use the union value.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union SgrAttributeValue {
    pub unknown: SgrUnknown,
    pub underline: SgrUnderline::Type,
    pub underline_color: ColorRgb,
    pub underline_color_256: ColorPaletteIndex,
    pub direct_color_fg: ColorRgb,
    pub direct_color_bg: ColorRgb,
    pub bg_8: ColorPaletteIndex,
    pub fg_8: ColorPaletteIndex,
    pub bright_bg_8: ColorPaletteIndex,
    pub bright_fg_8: ColorPaletteIndex,
    pub bg_256: ColorPaletteIndex,
    pub fg_256: ColorPaletteIndex,
    pub _padding: [u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SgrAttributeValue"][::std::mem::size_of::<SgrAttributeValue>() - 64usize];
    ["Alignment of SgrAttributeValue"][::std::mem::align_of::<SgrAttributeValue>() - 8usize];
    ["Offset of field: SgrAttributeValue::unknown"]
        [::std::mem::offset_of!(SgrAttributeValue, unknown) - 0usize];
    ["Offset of field: SgrAttributeValue::underline"]
        [::std::mem::offset_of!(SgrAttributeValue, underline) - 0usize];
    ["Offset of field: SgrAttributeValue::underline_color"]
        [::std::mem::offset_of!(SgrAttributeValue, underline_color) - 0usize];
    ["Offset of field: SgrAttributeValue::underline_color_256"]
        [::std::mem::offset_of!(SgrAttributeValue, underline_color_256) - 0usize];
    ["Offset of field: SgrAttributeValue::direct_color_fg"]
        [::std::mem::offset_of!(SgrAttributeValue, direct_color_fg) - 0usize];
    ["Offset of field: SgrAttributeValue::direct_color_bg"]
        [::std::mem::offset_of!(SgrAttributeValue, direct_color_bg) - 0usize];
    ["Offset of field: SgrAttributeValue::bg_8"]
        [::std::mem::offset_of!(SgrAttributeValue, bg_8) - 0usize];
    ["Offset of field: SgrAttributeValue::fg_8"]
        [::std::mem::offset_of!(SgrAttributeValue, fg_8) - 0usize];
    ["Offset of field: SgrAttributeValue::bright_bg_8"]
        [::std::mem::offset_of!(SgrAttributeValue, bright_bg_8) - 0usize];
    ["Offset of field: SgrAttributeValue::bright_fg_8"]
        [::std::mem::offset_of!(SgrAttributeValue, bright_fg_8) - 0usize];
    ["Offset of field: SgrAttributeValue::bg_256"]
        [::std::mem::offset_of!(SgrAttributeValue, bg_256) - 0usize];
    ["Offset of field: SgrAttributeValue::fg_256"]
        [::std::mem::offset_of!(SgrAttributeValue, fg_256) - 0usize];
    ["Offset of field: SgrAttributeValue::_padding"]
        [::std::mem::offset_of!(SgrAttributeValue, _padding) - 0usize];
};
impl Default for SgrAttributeValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " SGR attribute (tagged union).\n\n A complete SGR attribute with both its type tag and associated value.\n Always check the tag field to determine which value union member is valid.\n\n Attributes without associated data (e.g., GHOSTTY_SGR_ATTR_BOLD) can be\n identified by tag alone; the value union is not used for these and\n the memory in the value field is undefined.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SgrAttribute {
    pub tag: SgrAttributeTag::Type,
    pub value: SgrAttributeValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SgrAttribute"][::std::mem::size_of::<SgrAttribute>() - 72usize];
    ["Alignment of SgrAttribute"][::std::mem::align_of::<SgrAttribute>() - 8usize];
    ["Offset of field: SgrAttribute::tag"][::std::mem::offset_of!(SgrAttribute, tag) - 0usize];
    ["Offset of field: SgrAttribute::value"][::std::mem::offset_of!(SgrAttribute, value) - 8usize];
};
impl Default for SgrAttribute {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Create a new SGR parser instance.\n\n Creates a new SGR (Select Graphic Rendition) parser using the provided\n allocator. The parser must be freed using ghostty_sgr_free() when\n no longer needed.\n\n NULL to use the default allocator\n"]
    pub fn ghostty_sgr_new(allocator: *const Allocator, parser: *mut SgrParser) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free an SGR parser instance.\n\n Releases all resources associated with the SGR parser. After this call,\n the parser handle becomes invalid and must not be used. This includes\n any attributes previously returned by ghostty_sgr_next().\n\n"]
    pub fn ghostty_sgr_free(parser: SgrParser);
}
unsafe extern "C" {
    #[doc = " Reset an SGR parser instance to the beginning of the parameter list.\n\n Resets the parser's iteration state without clearing the parameters.\n After calling this, ghostty_sgr_next() will start from the beginning\n of the parameter list again.\n\n"]
    pub fn ghostty_sgr_reset(parser: SgrParser);
}
unsafe extern "C" {
    #[doc = " Set SGR parameters for parsing.\n\n Sets the SGR parameter list to parse. Parameters are the numeric values\n from a CSI SGR sequence (e.g., for `ESC[1;31m`, params would be {1, 31}).\n\n The separators array optionally specifies the separator type for each\n parameter position. Each byte should be either ';' for semicolon or ':'\n for colon. This is needed for certain color formats that use colon\n separators (e.g., `ESC[4:3m` for curly underline). Any invalid separator\n values are treated as semicolons. The separators array must have the same\n length as the params array, if it is not NULL.\n\n If separators is NULL, all parameters are assumed to be semicolon-separated.\n\n This function makes an internal copy of the parameter and separator data,\n so the caller can safely free or modify the input arrays after this call.\n\n After calling this function, the parser is automatically reset and ready\n to iterate from the beginning.\n\n NULL\n"]
    pub fn ghostty_sgr_set_params(
        parser: SgrParser,
        params: *const u16,
        separators: *const ::std::os::raw::c_char,
        len: usize,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Get the next SGR attribute.\n\n Parses and returns the next attribute from the parameter list.\n Call this function repeatedly until it returns false to process\n all attributes in the sequence.\n\n"]
    pub fn ghostty_sgr_next(parser: SgrParser, attr: *mut SgrAttribute) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the full parameter list from an unknown SGR attribute.\n\n This function retrieves the full parameter list that was provided to the\n parser when an unknown attribute was encountered. Primarily useful in\n WebAssembly environments where accessing struct fields directly is difficult.\n\n"]
    pub fn ghostty_sgr_unknown_full(unknown: SgrUnknown, ptr: *mut *const u16) -> usize;
}
unsafe extern "C" {
    #[doc = " Get the partial parameter list from an unknown SGR attribute.\n\n This function retrieves the partial parameter list where parsing stopped\n when an unknown attribute was encountered. Primarily useful in WebAssembly\n environments where accessing struct fields directly is difficult.\n\n"]
    pub fn ghostty_sgr_unknown_partial(unknown: SgrUnknown, ptr: *mut *const u16) -> usize;
}
unsafe extern "C" {
    #[doc = " Get the tag from an SGR attribute.\n\n This function extracts the tag that identifies which type of attribute\n this is. Primarily useful in WebAssembly environments where accessing\n struct fields directly is difficult.\n\n"]
    pub fn ghostty_sgr_attribute_tag(attr: SgrAttribute) -> SgrAttributeTag::Type;
}
unsafe extern "C" {
    #[doc = " Get the value from an SGR attribute.\n\n This function returns a pointer to the value union from an SGR attribute. Use\n the tag to determine which field of the union is valid. Primarily useful in\n WebAssembly environments where accessing struct fields directly is difficult.\n\n"]
    pub fn ghostty_sgr_attribute_value(attr: *mut SgrAttribute) -> *mut SgrAttributeValue;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct KeyEventImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a key event.\n\n This handle represents a keyboard input event containing information about\n the physical key pressed, modifiers, and generated text.\n"]
pub type KeyEvent = *mut KeyEventImpl;
pub mod KeyAction {
    #[doc = " Keyboard input event types.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Key was released"]
    pub const RELEASE: Type = 0;
    #[doc = " Key was pressed"]
    pub const PRESS: Type = 1;
    #[doc = " Key is being repeated (held down)"]
    pub const REPEAT: Type = 2;
}
#[doc = " Keyboard modifier keys bitmask.\n\n A bitmask representing all keyboard modifiers. This tracks which modifier keys\n are pressed and, where supported by the platform, which side (left or right)\n of each modifier is active.\n\n Use the GHOSTTY_MODS_* constants to test and set individual modifiers.\n\n Modifier side bits are only meaningful when the corresponding modifier bit is set.\n Not all platforms support distinguishing between left and right modifier\n keys and Ghostty is built to expect that some platforms may not provide this\n information.\n"]
pub type Mods = u16;
pub mod Key {
    #[doc = " Physical key codes.\n\n The set of key codes that Ghostty is aware of. These represent physical keys\n on the keyboard and are layout-independent. For example, the \"a\" key on a US\n keyboard is the same as the \"ф\" key on a Russian keyboard, but both will\n report the same key_a value.\n\n Layout-dependent strings are provided separately as UTF-8 text and are produced\n by the platform. These values are based on the W3C UI Events KeyboardEvent code\n standard. See: https://www.w3.org/TR/uievents-code\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const UNIDENTIFIED: Type = 0;
    pub const BACKQUOTE: Type = 1;
    pub const BACKSLASH: Type = 2;
    pub const BRACKET_LEFT: Type = 3;
    pub const BRACKET_RIGHT: Type = 4;
    pub const COMMA: Type = 5;
    pub const DIGIT_0: Type = 6;
    pub const DIGIT_1: Type = 7;
    pub const DIGIT_2: Type = 8;
    pub const DIGIT_3: Type = 9;
    pub const DIGIT_4: Type = 10;
    pub const DIGIT_5: Type = 11;
    pub const DIGIT_6: Type = 12;
    pub const DIGIT_7: Type = 13;
    pub const DIGIT_8: Type = 14;
    pub const DIGIT_9: Type = 15;
    pub const EQUAL: Type = 16;
    pub const INTL_BACKSLASH: Type = 17;
    pub const INTL_RO: Type = 18;
    pub const INTL_YEN: Type = 19;
    pub const A: Type = 20;
    pub const B: Type = 21;
    pub const C: Type = 22;
    pub const D: Type = 23;
    pub const E: Type = 24;
    pub const F: Type = 25;
    pub const G: Type = 26;
    pub const H: Type = 27;
    pub const I: Type = 28;
    pub const J: Type = 29;
    pub const K: Type = 30;
    pub const L: Type = 31;
    pub const M: Type = 32;
    pub const N: Type = 33;
    pub const O: Type = 34;
    pub const P: Type = 35;
    pub const Q: Type = 36;
    pub const R: Type = 37;
    pub const S: Type = 38;
    pub const T: Type = 39;
    pub const U: Type = 40;
    pub const V: Type = 41;
    pub const W: Type = 42;
    pub const X: Type = 43;
    pub const Y: Type = 44;
    pub const Z: Type = 45;
    pub const MINUS: Type = 46;
    pub const PERIOD: Type = 47;
    pub const QUOTE: Type = 48;
    pub const SEMICOLON: Type = 49;
    pub const SLASH: Type = 50;
    pub const ALT_LEFT: Type = 51;
    pub const ALT_RIGHT: Type = 52;
    pub const BACKSPACE: Type = 53;
    pub const CAPS_LOCK: Type = 54;
    pub const CONTEXT_MENU: Type = 55;
    pub const CONTROL_LEFT: Type = 56;
    pub const CONTROL_RIGHT: Type = 57;
    pub const ENTER: Type = 58;
    pub const META_LEFT: Type = 59;
    pub const META_RIGHT: Type = 60;
    pub const SHIFT_LEFT: Type = 61;
    pub const SHIFT_RIGHT: Type = 62;
    pub const SPACE: Type = 63;
    pub const TAB: Type = 64;
    pub const CONVERT: Type = 65;
    pub const KANA_MODE: Type = 66;
    pub const NON_CONVERT: Type = 67;
    pub const DELETE: Type = 68;
    pub const END: Type = 69;
    pub const HELP: Type = 70;
    pub const HOME: Type = 71;
    pub const INSERT: Type = 72;
    pub const PAGE_DOWN: Type = 73;
    pub const PAGE_UP: Type = 74;
    pub const ARROW_DOWN: Type = 75;
    pub const ARROW_LEFT: Type = 76;
    pub const ARROW_RIGHT: Type = 77;
    pub const ARROW_UP: Type = 78;
    pub const NUM_LOCK: Type = 79;
    pub const NUMPAD_0: Type = 80;
    pub const NUMPAD_1: Type = 81;
    pub const NUMPAD_2: Type = 82;
    pub const NUMPAD_3: Type = 83;
    pub const NUMPAD_4: Type = 84;
    pub const NUMPAD_5: Type = 85;
    pub const NUMPAD_6: Type = 86;
    pub const NUMPAD_7: Type = 87;
    pub const NUMPAD_8: Type = 88;
    pub const NUMPAD_9: Type = 89;
    pub const NUMPAD_ADD: Type = 90;
    pub const NUMPAD_BACKSPACE: Type = 91;
    pub const NUMPAD_CLEAR: Type = 92;
    pub const NUMPAD_CLEAR_ENTRY: Type = 93;
    pub const NUMPAD_COMMA: Type = 94;
    pub const NUMPAD_DECIMAL: Type = 95;
    pub const NUMPAD_DIVIDE: Type = 96;
    pub const NUMPAD_ENTER: Type = 97;
    pub const NUMPAD_EQUAL: Type = 98;
    pub const NUMPAD_MEMORY_ADD: Type = 99;
    pub const NUMPAD_MEMORY_CLEAR: Type = 100;
    pub const NUMPAD_MEMORY_RECALL: Type = 101;
    pub const NUMPAD_MEMORY_STORE: Type = 102;
    pub const NUMPAD_MEMORY_SUBTRACT: Type = 103;
    pub const NUMPAD_MULTIPLY: Type = 104;
    pub const NUMPAD_PAREN_LEFT: Type = 105;
    pub const NUMPAD_PAREN_RIGHT: Type = 106;
    pub const NUMPAD_SUBTRACT: Type = 107;
    pub const NUMPAD_SEPARATOR: Type = 108;
    pub const NUMPAD_UP: Type = 109;
    pub const NUMPAD_DOWN: Type = 110;
    pub const NUMPAD_RIGHT: Type = 111;
    pub const NUMPAD_LEFT: Type = 112;
    pub const NUMPAD_BEGIN: Type = 113;
    pub const NUMPAD_HOME: Type = 114;
    pub const NUMPAD_END: Type = 115;
    pub const NUMPAD_INSERT: Type = 116;
    pub const NUMPAD_DELETE: Type = 117;
    pub const NUMPAD_PAGE_UP: Type = 118;
    pub const NUMPAD_PAGE_DOWN: Type = 119;
    pub const ESCAPE: Type = 120;
    pub const F1: Type = 121;
    pub const F2: Type = 122;
    pub const F3: Type = 123;
    pub const F4: Type = 124;
    pub const F5: Type = 125;
    pub const F6: Type = 126;
    pub const F7: Type = 127;
    pub const F8: Type = 128;
    pub const F9: Type = 129;
    pub const F10: Type = 130;
    pub const F11: Type = 131;
    pub const F12: Type = 132;
    pub const F13: Type = 133;
    pub const F14: Type = 134;
    pub const F15: Type = 135;
    pub const F16: Type = 136;
    pub const F17: Type = 137;
    pub const F18: Type = 138;
    pub const F19: Type = 139;
    pub const F20: Type = 140;
    pub const F21: Type = 141;
    pub const F22: Type = 142;
    pub const F23: Type = 143;
    pub const F24: Type = 144;
    pub const F25: Type = 145;
    pub const FN: Type = 146;
    pub const FN_LOCK: Type = 147;
    pub const PRINT_SCREEN: Type = 148;
    pub const SCROLL_LOCK: Type = 149;
    pub const PAUSE: Type = 150;
    pub const BROWSER_BACK: Type = 151;
    pub const BROWSER_FAVORITES: Type = 152;
    pub const BROWSER_FORWARD: Type = 153;
    pub const BROWSER_HOME: Type = 154;
    pub const BROWSER_REFRESH: Type = 155;
    pub const BROWSER_SEARCH: Type = 156;
    pub const BROWSER_STOP: Type = 157;
    pub const EJECT: Type = 158;
    pub const LAUNCH_APP_1: Type = 159;
    pub const LAUNCH_APP_2: Type = 160;
    pub const LAUNCH_MAIL: Type = 161;
    pub const MEDIA_PLAY_PAUSE: Type = 162;
    pub const MEDIA_SELECT: Type = 163;
    pub const MEDIA_STOP: Type = 164;
    pub const MEDIA_TRACK_NEXT: Type = 165;
    pub const MEDIA_TRACK_PREVIOUS: Type = 166;
    pub const POWER: Type = 167;
    pub const SLEEP: Type = 168;
    pub const AUDIO_VOLUME_DOWN: Type = 169;
    pub const AUDIO_VOLUME_MUTE: Type = 170;
    pub const AUDIO_VOLUME_UP: Type = 171;
    pub const WAKE_UP: Type = 172;
    pub const COPY: Type = 173;
    pub const CUT: Type = 174;
    pub const PASTE: Type = 175;
}
unsafe extern "C" {
    #[doc = " Create a new key event instance.\n\n Creates a new key event with default values. The event must be freed using\n ghostty_key_event_free() when no longer needed.\n\n"]
    pub fn ghostty_key_event_new(allocator: *const Allocator, event: *mut KeyEvent)
    -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a key event instance.\n\n Releases all resources associated with the key event. After this call,\n the event handle becomes invalid and must not be used.\n\n"]
    pub fn ghostty_key_event_free(event: KeyEvent);
}
unsafe extern "C" {
    #[doc = " Set the key action (press, release, repeat).\n\n"]
    pub fn ghostty_key_event_set_action(event: KeyEvent, action: KeyAction::Type);
}
unsafe extern "C" {
    #[doc = " Get the key action (press, release, repeat).\n\n"]
    pub fn ghostty_key_event_get_action(event: KeyEvent) -> KeyAction::Type;
}
unsafe extern "C" {
    #[doc = " Set the physical key code.\n\n"]
    pub fn ghostty_key_event_set_key(event: KeyEvent, key: Key::Type);
}
unsafe extern "C" {
    #[doc = " Get the physical key code.\n\n"]
    pub fn ghostty_key_event_get_key(event: KeyEvent) -> Key::Type;
}
unsafe extern "C" {
    #[doc = " Set the modifier keys bitmask.\n\n"]
    pub fn ghostty_key_event_set_mods(event: KeyEvent, mods: Mods);
}
unsafe extern "C" {
    #[doc = " Get the modifier keys bitmask.\n\n"]
    pub fn ghostty_key_event_get_mods(event: KeyEvent) -> Mods;
}
unsafe extern "C" {
    #[doc = " Set the consumed modifiers bitmask.\n\n"]
    pub fn ghostty_key_event_set_consumed_mods(event: KeyEvent, consumed_mods: Mods);
}
unsafe extern "C" {
    #[doc = " Get the consumed modifiers bitmask.\n\n"]
    pub fn ghostty_key_event_get_consumed_mods(event: KeyEvent) -> Mods;
}
unsafe extern "C" {
    #[doc = " Set whether the key event is part of a composition sequence.\n\n"]
    pub fn ghostty_key_event_set_composing(event: KeyEvent, composing: bool);
}
unsafe extern "C" {
    #[doc = " Get whether the key event is part of a composition sequence.\n\n"]
    pub fn ghostty_key_event_get_composing(event: KeyEvent) -> bool;
}
unsafe extern "C" {
    #[doc = " Set the UTF-8 text generated by the key for the current keyboard layout.\n\n Must contain the unmodified character before any Ctrl/Meta transformations.\n The encoder derives modifier sequences from the logical key and mods\n bitmask, not from this text. Do not pass C0 control characters\n (U+0000-U+001F, U+007F) or platform function key codes (e.g. macOS PUA\n U+F700-U+F8FF); pass NULL instead and let the encoder use the logical key.\n\n The key event does NOT take ownership of the text pointer. The caller\n must ensure the string remains valid for the lifetime needed by the event.\n\n"]
    pub fn ghostty_key_event_set_utf8(
        event: KeyEvent,
        utf8: *const ::std::os::raw::c_char,
        len: usize,
    );
}
unsafe extern "C" {
    #[doc = " Get the UTF-8 text generated by the key event.\n\n The returned pointer is valid until the event is freed or the UTF-8 text is modified.\n\n"]
    pub fn ghostty_key_event_get_utf8(
        event: KeyEvent,
        len: *mut usize,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " Set the unshifted Unicode codepoint.\n\n"]
    pub fn ghostty_key_event_set_unshifted_codepoint(event: KeyEvent, codepoint: u32);
}
unsafe extern "C" {
    #[doc = " Get the unshifted Unicode codepoint.\n\n"]
    pub fn ghostty_key_event_get_unshifted_codepoint(event: KeyEvent) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct KeyEncoderImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a key encoder instance.\n\n This handle represents a key encoder that converts key events into terminal\n escape sequences.\n"]
pub type KeyEncoder = *mut KeyEncoderImpl;
#[doc = " Kitty keyboard protocol flags.\n\n Bitflags representing the various modes of the Kitty keyboard protocol.\n These can be combined using bitwise OR operations. Valid values all\n start with `GHOSTTY_KITTY_KEY_`.\n"]
pub type KittyKeyFlags = u8;
pub mod OptionAsAlt {
    #[doc = " macOS option key behavior.\n\n Determines whether the \"option\" key on macOS is treated as \"alt\" or not.\n See the Ghostty `macos-option-as-alt` configuration option for more details.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Option key is not treated as alt"]
    pub const FALSE: Type = 0;
    #[doc = " Option key is treated as alt"]
    pub const TRUE: Type = 1;
    #[doc = " Only left option key is treated as alt"]
    pub const LEFT: Type = 2;
    #[doc = " Only right option key is treated as alt"]
    pub const RIGHT: Type = 3;
}
pub mod KeyEncoderOption {
    #[doc = " Key encoder option identifiers.\n\n These values are used with ghostty_key_encoder_setopt() to configure\n the behavior of the key encoder.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Terminal DEC mode 1: cursor key application mode (value: bool)"]
    pub const CURSOR_KEY_APPLICATION: Type = 0;
    #[doc = " Terminal DEC mode 66: keypad key application mode (value: bool)"]
    pub const KEYPAD_KEY_APPLICATION: Type = 1;
    #[doc = " Terminal DEC mode 1035: ignore keypad with numlock (value: bool)"]
    pub const IGNORE_KEYPAD_WITH_NUMLOCK: Type = 2;
    #[doc = " Terminal DEC mode 1036: alt sends escape prefix (value: bool)"]
    pub const ALT_ESC_PREFIX: Type = 3;
    #[doc = " xterm modifyOtherKeys mode 2 (value: bool)"]
    pub const MODIFY_OTHER_KEYS_STATE_2: Type = 4;
    #[doc = " Kitty keyboard protocol flags (value: GhosttyKittyKeyFlags bitmask)"]
    pub const KITTY_FLAGS: Type = 5;
    #[doc = " macOS option-as-alt setting (value: GhosttyOptionAsAlt)"]
    pub const MACOS_OPTION_AS_ALT: Type = 6;
}
unsafe extern "C" {
    #[doc = " Create a new key encoder instance.\n\n Creates a new key encoder with default options. The encoder can be configured\n using ghostty_key_encoder_setopt() and must be freed using\n ghostty_key_encoder_free() when no longer needed.\n\n"]
    pub fn ghostty_key_encoder_new(
        allocator: *const Allocator,
        encoder: *mut KeyEncoder,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a key encoder instance.\n\n Releases all resources associated with the key encoder. After this call,\n the encoder handle becomes invalid and must not be used.\n\n"]
    pub fn ghostty_key_encoder_free(encoder: KeyEncoder);
}
unsafe extern "C" {
    #[doc = " Set an option on the key encoder.\n\n Configures the behavior of the key encoder. Options control various aspects\n of encoding such as terminal modes (cursor key application mode, keypad mode),\n protocol selection (Kitty keyboard protocol flags), and platform-specific\n behaviors (macOS option-as-alt).\n\n If you are using a terminal instance, you can set the key encoding\n options based on the active terminal state (e.g. legacy vs Kitty mode\n and associated flags) with ghostty_key_encoder_setopt_from_terminal().\n\n A null pointer value does nothing. It does not reset the value to the\n default. The setopt call will do nothing.\n\n"]
    pub fn ghostty_key_encoder_setopt(
        encoder: KeyEncoder,
        option: KeyEncoderOption::Type,
        value: *const ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    #[doc = " Set encoder options from a terminal's current state.\n\n Reads the terminal's current modes and flags and applies them to the\n encoder's options. This sets cursor key application mode, keypad mode,\n alt escape prefix, modifyOtherKeys state, and Kitty keyboard protocol\n flags from the terminal state.\n\n Note that the `macos_option_as_alt` option cannot be determined from\n terminal state and is reset to `GHOSTTY_OPTION_AS_ALT_FALSE` by this\n call. Use ghostty_key_encoder_setopt() to set it afterward if needed.\n\n"]
    pub fn ghostty_key_encoder_setopt_from_terminal(encoder: KeyEncoder, terminal: Terminal);
}
unsafe extern "C" {
    #[doc = " Encode a key event into a terminal escape sequence.\n\n Converts a key event into the appropriate terminal escape sequence based on\n the encoder's current options. The sequence is written to the provided buffer.\n\n Not all key events produce output. For example, unmodified modifier keys\n typically don't generate escape sequences. Check the out_len parameter to\n determine if any data was written.\n\n If the output buffer is too small, this function returns GHOSTTY_OUT_OF_SPACE\n and out_len will contain the required buffer size. The caller can then\n allocate a larger buffer and call the function again.\n\n\n ## Example: Calculate required buffer size\n\n // Query the required size with a NULL buffer (always returns OUT_OF_SPACE)\n size_t required = 0;\n GhosttyResult result = ghostty_key_encoder_encode(encoder, event, NULL, 0, &required);\n assert(result == GHOSTTY_OUT_OF_SPACE);\n\n // Allocate buffer of required size\n char *buf = malloc(required);\n\n // Encode with properly sized buffer\n size_t written = 0;\n result = ghostty_key_encoder_encode(encoder, event, buf, required, &written);\n assert(result == GHOSTTY_SUCCESS);\n\n // Use the encoded sequence...\n\n free(buf);\n\n ## Example: Direct encoding with static buffer\n\n // Most escape sequences are short, so a static buffer often suffices\n char buf[128];\n size_t written = 0;\n GhosttyResult result = ghostty_key_encoder_encode(encoder, event, buf, sizeof(buf), &written);\n\n if (result == GHOSTTY_SUCCESS) {\n   // Write the encoded sequence to the terminal\n   write(pty_fd, buf, written);\n } else if (result == GHOSTTY_OUT_OF_SPACE) {\n   // Buffer too small, written contains required size\n   char *dynamic_buf = malloc(written);\n   result = ghostty_key_encoder_encode(encoder, event, dynamic_buf, written, &written);\n   assert(result == GHOSTTY_SUCCESS);\n   write(pty_fd, dynamic_buf, written);\n   free(dynamic_buf);\n }\n"]
    pub fn ghostty_key_encoder_encode(
        encoder: KeyEncoder,
        event: KeyEvent,
        out_buf: *mut ::std::os::raw::c_char,
        out_buf_size: usize,
        out_len: *mut usize,
    ) -> Result::Type;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MouseEventImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a mouse event.\n\n This handle represents a normalized mouse input event containing\n action, button, modifiers, and surface-space position.\n"]
pub type MouseEvent = *mut MouseEventImpl;
pub mod MouseAction {
    #[doc = " Mouse event action type.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Mouse button was pressed."]
    pub const PRESS: Type = 0;
    #[doc = " Mouse button was released."]
    pub const RELEASE: Type = 1;
    #[doc = " Mouse moved."]
    pub const MOTION: Type = 2;
}
pub mod MouseButton {
    #[doc = " Mouse button identity.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const UNKNOWN: Type = 0;
    pub const LEFT: Type = 1;
    pub const RIGHT: Type = 2;
    pub const MIDDLE: Type = 3;
    pub const FOUR: Type = 4;
    pub const FIVE: Type = 5;
    pub const SIX: Type = 6;
    pub const SEVEN: Type = 7;
    pub const EIGHT: Type = 8;
    pub const NINE: Type = 9;
    pub const TEN: Type = 10;
    pub const ELEVEN: Type = 11;
}
#[doc = " Mouse position in surface-space pixels.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MousePosition {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MousePosition"][::std::mem::size_of::<MousePosition>() - 8usize];
    ["Alignment of MousePosition"][::std::mem::align_of::<MousePosition>() - 4usize];
    ["Offset of field: MousePosition::x"][::std::mem::offset_of!(MousePosition, x) - 0usize];
    ["Offset of field: MousePosition::y"][::std::mem::offset_of!(MousePosition, y) - 4usize];
};
unsafe extern "C" {
    #[doc = " Create a new mouse event instance.\n\n"]
    pub fn ghostty_mouse_event_new(
        allocator: *const Allocator,
        event: *mut MouseEvent,
    ) -> Result::Type;
}
unsafe extern "C" {
    #[doc = " Free a mouse event instance.\n\n"]
    pub fn ghostty_mouse_event_free(event: MouseEvent);
}
unsafe extern "C" {
    #[doc = " Set the event action.\n\n"]
    pub fn ghostty_mouse_event_set_action(event: MouseEvent, action: MouseAction::Type);
}
unsafe extern "C" {
    #[doc = " Get the event action.\n\n"]
    pub fn ghostty_mouse_event_get_action(event: MouseEvent) -> MouseAction::Type;
}
unsafe extern "C" {
    #[doc = " Set the event button.\n\n This sets a concrete button identity for the event.\n To represent \"no button\" (for motion events), use\n ghostty_mouse_event_clear_button().\n\n"]
    pub fn ghostty_mouse_event_set_button(event: MouseEvent, button: MouseButton::Type);
}
unsafe extern "C" {
    #[doc = " Clear the event button.\n\n This sets the event button to \"none\".\n\n"]
    pub fn ghostty_mouse_event_clear_button(event: MouseEvent);
}
unsafe extern "C" {
    #[doc = " Get the event button.\n\n"]
    pub fn ghostty_mouse_event_get_button(
        event: MouseEvent,
        out_button: *mut MouseButton::Type,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Set keyboard modifiers held during the event.\n\n"]
    pub fn ghostty_mouse_event_set_mods(event: MouseEvent, mods: Mods);
}
unsafe extern "C" {
    #[doc = " Get keyboard modifiers held during the event.\n\n"]
    pub fn ghostty_mouse_event_get_mods(event: MouseEvent) -> Mods;
}
unsafe extern "C" {
    #[doc = " Set the event position in surface-space pixels.\n\n"]
    pub fn ghostty_mouse_event_set_position(event: MouseEvent, position: MousePosition);
}
unsafe extern "C" {
    #[doc = " Get the event position in surface-space pixels.\n\n"]
    pub fn ghostty_mouse_event_get_position(event: MouseEvent) -> MousePosition;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MouseEncoderImpl {
    _unused: [u8; 0],
}
#[doc = " Opaque handle to a mouse encoder instance.\n\n This handle represents a mouse encoder that converts normalized\n mouse events into terminal escape sequences.\n"]
pub type MouseEncoder = *mut MouseEncoderImpl;
pub mod MouseTrackingMode {
    #[doc = " Mouse tracking mode.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Mouse reporting disabled."]
    pub const NONE: Type = 0;
    #[doc = " X10 mouse mode."]
    pub const X10: Type = 1;
    #[doc = " Normal mouse mode (button press/release only)."]
    pub const NORMAL: Type = 2;
    #[doc = " Button-event tracking mode."]
    pub const BUTTON: Type = 3;
    #[doc = " Any-event tracking mode."]
    pub const ANY: Type = 4;
}
pub mod MouseFormat {
    #[doc = " Mouse output format.\n"]
    pub type Type = ::std::os::raw::c_uint;
    pub const X10: Type = 0;
    pub const UTF8: Type = 1;
    pub const SGR: Type = 2;
    pub const URXVT: Type = 3;
    pub const SGR_PIXELS: Type = 4;
}
#[doc = " Mouse encoder size and geometry context.\n\n This describes the rendered terminal geometry used to convert\n surface-space positions into encoded coordinates.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MouseEncoderSize {
    #[doc = " Size of this struct in bytes. Must be set to sizeof(GhosttyMouseEncoderSize)."]
    pub size: usize,
    #[doc = " Full screen width in pixels."]
    pub screen_width: u32,
    #[doc = " Full screen height in pixels."]
    pub screen_height: u32,
    #[doc = " Cell width in pixels. Must be non-zero."]
    pub cell_width: u32,
    #[doc = " Cell height in pixels. Must be non-zero."]
    pub cell_height: u32,
    #[doc = " Top padding in pixels."]
    pub padding_top: u32,
    #[doc = " Bottom padding in pixels."]
    pub padding_bottom: u32,
    #[doc = " Right padding in pixels."]
    pub padding_right: u32,
    #[doc = " Left padding in pixels."]
    pub padding_left: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MouseEncoderSize"][::std::mem::size_of::<MouseEncoderSize>() - 40usize];
    ["Alignment of MouseEncoderSize"][::std::mem::align_of::<MouseEncoderSize>() - 8usize];
    ["Offset of field: MouseEncoderSize::size"]
        [::std::mem::offset_of!(MouseEncoderSize, size) - 0usize];
    ["Offset of field: MouseEncoderSize::screen_width"]
        [::std::mem::offset_of!(MouseEncoderSize, screen_width) - 8usize];
    ["Offset of field: MouseEncoderSize::screen_height"]
        [::std::mem::offset_of!(MouseEncoderSize, screen_height) - 12usize];
    ["Offset of field: MouseEncoderSize::cell_width"]
        [::std::mem::offset_of!(MouseEncoderSize, cell_width) - 16usize];
    ["Offset of field: MouseEncoderSize::cell_height"]
        [::std::mem::offset_of!(MouseEncoderSize, cell_height) - 20usize];
    ["Offset of field: MouseEncoderSize::padding_top"]
        [::std::mem::offset_of!(MouseEncoderSize, padding_top) - 24usize];
    ["Offset of field: MouseEncoderSize::padding_bottom"]
        [::std::mem::offset_of!(MouseEncoderSize, padding_bottom) - 28usize];
    ["Offset of field: MouseEncoderSize::padding_right"]
        [::std::mem::offset_of!(MouseEncoderSize, padding_right) - 32usize];
    ["Offset of field: MouseEncoderSize::padding_left"]
        [::std::mem::offset_of!(MouseEncoderSize, padding_left) - 36usize];
};
pub mod MouseEncoderOption {
    #[doc = " Mouse encoder option identifiers.\n\n These values are used with ghostty_mouse_encoder_setopt() to configure\n the behavior of the mouse encoder.\n"]
    pub type Type = ::std::os::raw::c_uint;
    #[doc = " Mouse tracking mode (value: GhosttyMouseTrackingMode)."]
    pub const EVENT: Type = 0;
    #[doc = " Mouse output format (value: GhosttyMouseFormat)."]
    pub const FORMAT: Type = 1;
    #[doc = " Renderer size context (value: GhosttyMouseEncoderSize)."]
    pub const SIZE: Type = 2;
    #[doc = " Whether any mouse button is currently pressed (value: bool)."]
    pub const ANY_BUTTON_PRESSED: Type = 3;
    #[doc = " Whether to enable motion deduplication by last cell (value: bool)."]
    pub const TRACK_LAST_CELL: Type = 4;
}
unsafe extern "C" {
    #[doc = " Create a new mouse encoder instance.\n\n"]
